omniosorg/pkg5/src/man/lipkg.5
.\"
.\" This file and its contents are supplied under the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.illumos.org/license/CDDL.
.\"
.\" Copyright 2019 OmniOS Community Edition (OmniOSce) Association.
.\"
.Dd March 25, 2019
.Dt LIPKG 5
.Os
.Sh NAME
.Nm lipkg
.Nd zone brand for running a full copy of OmniOS with linked packages
.Sh DESCRIPTION
The
.Em lipkg
brand
uses the
.Xr brands 5
framework to provide an environment for running a full copy of Omnios, with
system software packages linked to those installed in the global zone.
.Pp
A linked-ipkg (
.Em lipkg )
zone is an extension of an
.Xr ipkg 5
zone which has its
installed software set linked to that within the global zone.
By default, when performing a package update from the global zone,
core system packages within
.Em lipkg
zones are automatically updated at the same time.
It is possible to extend this to upgrade all packages and to upgrade multiple
.Em lipkg
zones in parallel via command line options or pkg properties.
.Pp
A further benefit over
.Xr ipkg 5
zones is that major version upgrades can be performed without having to detach
and re-attach the zones.
.Pp
Like
.Xr ipkg 5
zones,
.Em lipkg
zones can have multiple boot environments, created either locally within the
zone or managed automatically from the global zone as BEs are
created/destroyed there.
.Pp
Even though the software image is linked to the global zone, it is perfectly
possible to have a different set of packages installed in an lipkg zone as long
as system consistency rules are met.
.Sh CONFIGURATION
Persistent network configuration (including DNS resolver information) can be
configured using
.Xr zonecfg 1m .
An example
.Em lipkg
zone configured with VNIC "vnic0" using a static IP address is below:
.sp
.Bd -literal -offset indent
create -t lipkg
set zonepath=/zones/testzone
set autoboot=true
add net
    set physical=vnic0
    set allowed-address=192.168.0.2/24
    set defrouter=192.168.0.1
    set global-nic=auto
end
add attr
    set name=dns-domain
    set type=string
    set value=example.com
end
add attr
    set name=resolvers
    set type=string
    set value=192.168.12.1,192.168.13.1
end
.Ed
.sp
.Sh LIMITATIONS
.Em lipkg
zone boot environments are linked to the global zone boot environment under
which they were created.
This means that rolling back the global zone to a previous boot environment
will also roll back the zone.
For this reason, zone data which should be shared across boot environments
should be allocated to a dedicated dataset.
.Sh SEE ALSO
.Xr zfs 1m ,
.Xr zoneadm 1m ,
.Xr zonecfg 1m ,
.Xr brands 5 ,
.Xr ipkg 5 ,
.Xr privileges 5 ,
.Xr resource_controls 5 ,
.Xr zones 5
