omniosorg/pkg5/src/man/pkg.1
.\" Copyright (c) 2007, 2016, Oracle and/or its affiliates. All rights reserved.
.\" Copyright 2021 OmniOS Community Edition (OmniOSce) Association.
.Dd March 12, 2021
.Dt PKG 1
.Os OmniOS
.Sh NAME
.Nm pkg
.Nd Image Packaging System client
.Sh SYNOPSIS
.Nm
.Op Ar options
.Ar command
.Op Ar cmd_options
.Op Ar operands
.\" refresh
.Pp
.Nm
.Cm refresh
.Op Fl q
.Op Fl \-full
.Op Ar publisher No ...
.\" install
.Pp
.Nm
.Cm install
.Bk -words
.Op Fl nvq
.Op Fl C Ar n
.Oo Fl g Ar path_or_uri Oc Ns ...
.br
.Oo Fl r
.Oo Oo Fl z Ar zonename Oc Ns ... | Oo Fl Z Ar zonename Oc Ns ... Oc
.Oc
.br
.Op Fl \-accept
.Op Fl \-licenses
.Op Fl \-no-index
.Op Fl \-no-refresh
.br
.Op Fl \-no-be-activate | Fl \-temp-be-activate
.Op Fl \-no-backup-be | Fl \-require-backup-be
.Op Fl \-backup-be-name Ar name
.Op Fl \-deny-new-be | Fl \-require-new-be
.Op Fl \-be-name Ar name
.br
.Oo Fl \-reject Ar pkg_fmri_pattern Oc Ns ...
.Op Fl \-sync-actuators | Fl \-sync-actuators-timeout Ar timeout
.Ek
.br
.Ar pkg_fmri_pattern No ...
.\" exact-install
.Pp
.Nm
.Cm exact-install
.Bk -words
.Op Fl nvq
.Op Fl C Ar n
.Oo Fl g Ar path_or_uri Oc Ns ...
.br
.Op Fl \-accept
.Op Fl \-licenses
.Op Fl \-no-index
.Op Fl \-no-refresh
.br
.Op Fl \-no-be-activate | Fl \-temp-be-activate
.Op Fl \-no-backup-be | Fl \-require-backup-be
.Op Fl \-backup-be-name Ar name
.Op Fl \-deny-new-be | Fl \-require-new-be
.Op Fl \-be-name Ar name
.br
.Oo Fl \-reject Ar pkg_fmri_pattern Oc Ns ...
.Ek
.br
.Ar pkg_fmri_pattern No ...
.\" uninstall
.Pp
.Nm
.Cm uninstall
.Bk -words
.Op Fl nvq
.Op Fl C Ar n
.br
.Oo Fl r
.Oo Oo Fl z Ar zonename Oc Ns ... | Oo Fl Z Ar zonename Oc Ns ... Oc
.Oc
.br
.Op Fl \-ignore-missing
.Op Fl \-no-index
.br
.Op Fl \-no-be-activate | Fl \-temp-be-activate
.Op Fl \-no-backup-be | Fl \-require-backup-be
.Op Fl \-backup-be-name Ar name
.Op Fl \-deny-new-be | Fl \-require-new-be
.Op Fl \-be-name Ar name
.br
.Op Fl \-sync-actuators | Fl \-sync-actuators-timeout Ar timeout
.Ek
.br
.Ar pkg_fmri_pattern No ...
.\" update
.Pp
.Nm
.Cm update
.Bk -words
.Op Fl fnvq
.Op Fl C Ar n
.Oo Fl g Ar path_or_uri Oc Ns ...
.br
.Oo Fl R | Fl r
.Oo Oo Fl z Ar zonename Oc Ns ... | Oo Fl Z Ar zonename Oc Ns ... Oc
.Oc
.br
.Op Fl \-accept
.Op Fl \-ignore-missing
.Op Fl \-licenses
.Op Fl \-no-index
.Op Fl \-no-refresh
.br
.Op Fl \-no-be-activate | Fl \-temp-be-activate
.Op Fl \-no-backup-be | Fl \-require-backup-be
.Op Fl \-backup-be-name Ar name
.Op Fl \-deny-new-be | Fl \-require-new-be
.Op Fl \-be-name Ar name
.br
.Oo Fl \-reject Ar pkg_fmri_pattern Oc Ns ...
.br
.Op Fl \-sync-actuators | Fl \-sync-actuators-timeout Ar timeout
.Ek
.br
.Op Ar pkg_fmri_pattern No ...
.\" apply-hot-fix
.Pp
.Nm
.Cm apply-hot-fix
.Bk -words
.Op Fl nvq
.Op Fl C Ar n
.Oo Fl g Ar path_or_uri Oc Ns ...
.br
.Oo Fl R | Fl r
.Oo Oo Fl z Ar zonename Oc Ns ... | Oo Fl Z Ar zonename Oc Ns ... Oc
.Oc
.br
.Op Fl \-accept
.Op Fl \-ignore-missing
.Op Fl \-licenses
.Op Fl \-no-index
.Op Fl \-no-refresh
.br
.Op Fl \-no-be-activate | Fl \-temp-be-activate
.Op Fl \-no-backup-be | Fl \-require-backup-be
.Op Fl \-backup-be-name Ar name
.Op Fl \-deny-new-be | Fl \-require-new-be
.Op Fl \-be-name Ar name
.Ek
.br
.Ar path_or_uri
.Op Ar pkg_fmri_pattern No ...
.\" autoremove
.Pp
.Nm
.Cm autoremove
.Bk -words
.Op Fl nvq
.Op Fl C Ar n
.br
.Oo Fl r
.Oo Oo Fl z Ar zonename Oc Ns ... | Oo Fl Z Ar zonename Oc Ns ... Oc
.Oc
.br
.Op Fl \-ignore-missing
.Op Fl \-no-index
.br
.Op Fl \-no-be-activate | Fl \-temp-be-activate
.Op Fl \-no-backup-be | Fl \-require-backup-be
.Op Fl \-backup-be-name Ar name
.Op Fl \-deny-new-be | Fl \-require-new-be
.Op Fl \-be-name Ar name
.Ek
.br
.Op Fl \-sync-actuators | Fl \-sync-actuators-timeout Ar timeout
.\" list
.Pp
.Nm
.Cm list
.Bk -words
.Op Fl HafMmnqRrsuv
.Oo Fl g Ar path_or_uri Oc Ns ...
.Op Fl \-no-refresh
.Ek
.br
.Op Ar pkg_fmri_pattern No ...
.\" info
.Pp
.Nm
.Cm info
.Bk -words
.Op Fl lqr
.Oo Fl g Ar path_or_uri Oc Ns ...
.Op Fl \-license
.Ek
.br
.Op Ar pkg_fmri_pattern No ...
.\" contents
.Pp
.Nm
.Cm contents
.Bk -words
.Op Fl Hmr
.Oo Fl a Ar attribute Ns = Ns Ar pattern Oc Ns ...
.Oo Fl g Ar path_or_uri Oc Ns ...
.Oo Fl o Ar attribute Ns Oo , Ns Ar attribute Oc Ns ... Oc Ns ...
.Op Fl s Ar sort_key
.Oo Fl t Ar action_name Ns Oo , Ns Ar action_name Oc Ns ... Oc Ns ...
.Ek
.br
.Op Ar pkg_fmri_pattern No ...
.\" search
.Pp
.Nm
.Cm search
.Bk -words
.Op Fl HIaflpr
.Oo Fl o Ar attribute Ns Oo , Ns Ar attribute Oc Ns ... Oc Ns ...
.Op Fl s Ar repo_uri
.Ek
.Ar query
.\" verify
.Pp
.Nm
.Cm verify
.Bk -words
.Op Fl Hqv
.Op Fl p Ar path
.Op Fl \-parsable Ar version
.Op Fl \-unpackaged | Fl \-unpackaged-only
.Ek
.br
.Op Ar pkg_fmri_pattern No ...
.\" fix
.Pp
.Nm
.Cm fix
.Bk -words
.Op Fl nvq
.Op Fl \-accept
.Op Fl \-licenses
.br
.Op Fl \-no-be-activate | Fl \-temp-be-activate
.Op Fl \-no-backup-be | Fl \-require-backup-be
.Op Fl \-backup-be-name Ar name
.Op Fl \-deny-new-be | Fl \-require-new-be
.Op Fl \-be-name Ar name
.br
.Op Fl \-parsable Ar version
.Op Fl \-unpackaged
.Ek
.br
.Op Ar pkg_fmri_pattern No ...
.\" revert
.Pp
.Nm
.Cm revert
.Bk -words
.Op Fl nv
.br
.Op Fl \-no-be-activate | Fl \-temp-be-activate
.Op Fl \-no-backup-be | Fl \-require-backup-be
.Op Fl \-backup-be-name Ar name
.Op Fl \-deny-new-be | Fl \-require-new-be
.Op Fl \-be-name Ar name
.Ek
.br
.Pq Fl \-tagged Ar tag_name No ... | Ar path_to_file No ...
.\" mediator
.Pp
.Nm
.Cm mediator
.Op Fl aH
.Op Fl F Ar format
.Op Ar mediator No ...
.\" set-medaitor
.Pp
.Nm
.Cm set-mediator
.Bk -words
.Op Fl nv
.Op Fl I Ar implementation
.Op Fl V Ar version
.br
.Op Fl \-no-be-activate | Fl \-temp-be-activate
.Op Fl \-no-backup-be | Fl \-require-backup-be
.Op Fl \-backup-be-name Ar name
.Op Fl \-deny-new-be | Fl \-require-new-be
.Op Fl \-be-name Ar name
.Ek
.br
.Ar mediator No ...
.\" unset-mediator
.Pp
.Nm
.Cm unset-mediator
.Bk -words
.Op Fl nvIV
.br
.Op Fl \-no-be-activate | Fl \-temp-be-activate
.Op Fl \-no-backup-be | Fl \-require-backup-be
.Op Fl \-backup-be-name Ar name
.Op Fl \-deny-new-be | Fl \-require-new-be
.Op Fl \-be-name Ar name
.Ek
.br
.Ar mediator No ...
.\" variant
.Pp
.Nm
.Cm variant
.Op Fl HAiv
.Op Fl F Ar format
.Op Ar variant_pattern No ...
.\" change-variant
.Pp
.Nm
.Cm change-variant
.Bk -words
.Op Fl nvq
.Op Fl C Ar n
.Oo Fl g Ar path_or_uri Oc Ns ...
.br
.Oo Fl R | Fl r
.Oo Oo Fl z Ar zonename Oc Ns ... | Oo Fl Z Ar zonename Oc Ns ... Oc
.Oc
.br
.Op Fl \-accept
.Op Fl \-licenses
.br
.Op Fl \-no-be-activate | Fl \-temp-be-activate
.Op Fl \-no-backup-be | Fl \-require-backup-be
.Op Fl \-backup-be-name Ar name
.Op Fl \-deny-new-be | Fl \-require-new-be
.Op Fl \-be-name Ar name
.br
.Op Fl \-sync-actuators | Fl \-sync-actuators-timeout Ar timeout
.Ek
.br
.Ar variant_name Ns = Ns Ar value No ...
.\" facet
.Pp
.Nm
.Cm facet
.Op Fl Haim
.Op Fl F Ar format
.Op Ar facet_pattern No ...
.\" change-facet
.Pp
.Nm
.Cm change-facet
.Bk -words
.Op Fl nvq
.Op Fl C Ar n
.Oo Fl g Ar path_or_uri Oc Ns ...
.br
.Oo Fl R | Fl r
.Oo Oo Fl z Ar zonename Oc Ns ... | Oo Fl Z Ar zonename Oc Ns ... Oc
.Oc
.br
.Op Fl \-accept
.Op Fl \-licenses
.br
.Op Fl \-no-be-activate | Fl \-temp-be-activate
.Op Fl \-no-backup-be | Fl \-require-backup-be
.Op Fl \-backup-be-name Ar name
.Op Fl \-deny-new-be | Fl \-require-new-be
.Op Fl \-be-name Ar name
.br
.Op Fl \-sync-actuators | Fl \-sync-actuators-timeout Ar timeout
.br
.Ar facet_name Ns = Ns
.Sm off
.Pq Cm True | Cm False | Cm None
.Sm on
.Ek
.No ...
.\" avoid
.Pp
.Nm
.Cm avoid
.Op Ar pkg_fmri_pattern No ...
.\" unavoid
.Pp
.Nm
.Cm unavoid
.Op Ar pkg_fmri_pattern No ...
.\" freeze
.Pp
.Nm
.Cm freeze
.Op Fl n
.Op Fl c Ar reason
.Op Ar pkg_fmri_pattern No ...
.\" unfreeze
.Pp
.Nm
.Cm unfreeze
.Op Fl n
.Op Ar pkg_fmri_pattern No ...
.\" flag
.Pp
.Nm
.Cm flag
.Op Fl mM
.Op Ar pkg_fmri_pattern No ...
.\" clean
.Pp
.Nm
.Cm clean
.Op Fl v
.\" property
.Pp
.Nm
.Cm property
.Op Fl H
.Op Ar propname No ...
.\" set-property
.Pp
.Nm
.Cm set-property
.Ar propname propvalue
.\" add-property-value
.Pp
.Nm
.Cm add-property-value
.Ar propname propvalue
.\" remove-property-value
.Pp
.Nm
.Cm remove-property-value
.Ar propname propvalue
.\" unset-property
.Pp
.Nm
.Cm unset-property
.Ar propname No ...
.\" publisher
.Pp
.Nm
.Cm publisher
.Bk -words
.Op Fl HPn
.Op Fl F Ar format
.Op Ar publisher No ...
.Ek
.\" set-publisher
.Pp
.Nm
.Cm set-publisher
.Bk -words
.Op Fl Pedv
.Op Fl c Ar ssl_cert
.Op Fl k Ar ssl_key
.Op Fl O Ar origin_to_set | Fl \-origin-uri Ar origin_to_set
.Op Fl g Ar origin_to_add | Fl \-add-origin Ar origin_to_add
.Op Fl G Ar origin_to_remove | Fl \-remove-origin Ar origin_to_remove
.Op Fl m Ar mirror_to_add | Fl \-add-mirror Ar mirror_to_add
.Op Fl M Ar mirror_to_remove | Fl \-remove-mirror Ar mirror_to_remove
.br
.Oo Fl R | Fl r
.Oo Oo Fl z Ar zonename Oc Ns ... | Oo Fl Z Ar zonename Oc Ns ... Oc
.Oc
.br
.Op Fl \-disable
.Op Fl \-enable
.Op Fl \-refresh
.Op Fl \-reset-uuid
.Op Fl \-sticky
.Op Fl \-non-sticky
.Op Fl \-search-first
.Op Fl \-search-before Ar publisher
.Op Fl \-search-after Ar publisher
.Op Fl \-approve-ca-cert Ar path_to_CA
.Op Fl \-revoke-ca-cert Ar hash_of_CA_to_remove
.Op Fl \-unset-ca-cert Ar hash_of_CA_to_remove
.Op Fl \-set-property Ar name_of_property Ns = Ns Ar value
.Op Fl \-add-property-value Ar name_of_property Ns = Ns Ar value_to_add
.Op Fl \-remove-property-value Ar name_of_property Ns = Ns Ar value_to_remove
.Op Fl \-unset-property Ar name_of_property_to_delete
.Op Fl \-proxy Ar proxy_to_use
.Ek
.br
.Ar publisher
.\" set-publisher -p
.Pp
.Nm
.Cm set-publisher
.Bk -words
.Fl p Ar repo_uri
.Op Fl Ped
.Op Fl c Ar ssl_cert
.Op Fl k Ar ssl_key
.Op Fl \-sticky
.Op Fl \-non-sticky
.Op Fl \-search-first
.Op Fl \-search-before Ar publisher
.Op Fl \-search-after Ar publisher
.Op Fl \-approve-ca-cert Ar path_to_CA
.Op Fl \-revoke-ca-cert Ar hash_of_CA_to_remove
.Op Fl \-unset-ca-cert Ar hash_of_CA_to_remove
.Op Fl \-set-property Ar name_of_property Ns = Ns Ar value
.Op Fl \-add-property-value Ar name_of_property Ns = Ns Ar value_to_add
.Op Fl \-remove-property-value Ar name_of_property Ns = Ns Ar value_to_remove
.Op Fl \-unset-property Ar name_of_property_to_delete
.Op Fl \-proxy Ar proxy_to_use
.Ek
.br
.Ar publisher
.\" unset-publisher
.Pp
.Nm
.Cm unset-publisher
.Ar publisher No ...
.\" history
.Pp
.Nm
.Cm history
.Bk -words
.Op Fl HNl
.Op Fl n Ar number
.Oo Fl o Ar column Ns Oo , Ns Ar column Oc Ns ... Oc Ns ...
.Oo Fl t Ar time | Ar time Ns - Ns Ar time Ns
.Oo , Ns Ar time | Ar time Ns - Ns Ar time
.Oc Ns ... Oc Ns ...
.Ek
.\" purge-history
.Pp
.Nm
.Cm purge-history
.\" rebuild-index
.Pp
.Nm
.Cm rebuild-index
.\" update-format
.Pp
.Nm
.Cm update-format
.\" version
.Pp
.Nm
.Cm version
.\" help
.Pp
.Nm
.Cm help
.\" image-create
.Pp
.Nm
.Cm image-create
.Bk -words
.Op Fl FPUfz
.Op Fl \-force
.br
.Op Fl \-full | Fl \-partial | Fl \-user
.Op Fl \-zone
.Op Fl c Ar ssl_cert
.Op Fl k Ar ssl_key
.Oo Fl g Ar path_or_uri | Fl \-origin Ar path_or_uri Oc Ns ...
.Oo Fl m Ar uri | Fl \-mirror Ar uri Oc Ns ...
.Oo Fl \-facet Ar facet_name Ns = Ns
.Pq True Ns | Ns False
.Oc Ns ...
.Op Fl \-no-refresh
.Op Fl \-set-property Ar name_of_property Ns = Ns Ar value
.Op Fl \-variant Ar variant_name Ns = Ns Ar value
.Oo
.Pq Fl p | Fl \-publisher
.Oo Ar name Ns = Oc Ns Ar repo_uri Oc
.Ek
.br
.Ar dir
.\" dehydrate
.Pp
.Nm
.Fl R Ar dir Cm dehydrate
.Op Fl nvq
.Oo Fl p Ar publisher Oc Ns ...
.\" rehydrate
.Pp
.Nm
.Fl R Ar dir Cm rehydrate
.Op Fl nvq
.Oo Fl p Ar publisher Oc Ns ...
.\"
.Sh DESCRIPTION
.Nm
is the client for the Image Packaging System.
With a valid configuration,
.Nm
can be invoked to create locations for packages to be installed, called images,
and install packages into those images.
Packages are published by publishers, who can make their packages available at
one or more repositories, or in package archives.
.Nm
retrieves packages from a publisher\&'s repository or package archives and
installs the packages into an image.
.Pp
Packages can only be installed into file systems that are part of a
boot environment (BE).
For example, on a default OmniOS installation, only datasets under
.Pa rpool/ROOT/ Ns Ar BEname Ns /
are supported for package operations.
.Pp
A publisher name identifies a person, group of persons, or an organization as
the source of one or more packages.
To avoid publisher name collisions and help identify the publisher, a best
practice is to use a domain name that represents the entity publishing the
packages as a publisher name.
.Pp
A repository is a location where clients can publish and retrieve package
content (files contained within the package such as programs and documents) and
metadata (information about the package such as its name and description).
As an example, a publisher named
.Sy example.org
might have their repository located at the URI
.Sy http://example.org/repository .
.Pp
.Nm
can also uninstall packages, refresh publisher metadata (such as the list of
available packages), validate package installation in an image, and query the
image for various tokens.
These queries can also be made of
.Xr pkg 5 .
.Pp
Images can be of three types: full images, capable of providing a complete
system; partial images, which are linked to a full image (parent image), but do
not provide a complete system on their own; and user images.
.\"
.Sh OPTIONS
The following global options are supported:
.Bl -tag -width Ar
.It Fl ? | Fl \-help
Display a usage message.
.It Fl R Ar dir
Operate on the image rooted at
.Ar dir .
If no directory was specified or determined based on environment, the default
is
.Sq Pa / .
See the
.Sx Environment Variables
section for more information.
.El
.\"
.Sh SUB-COMMANDS
.\" refresh
.Nm
.Cm refresh
.Op Fl q
.Op Fl \-full
.Op Ar publisher No ...
.Bd -ragged -offset Ds
Update the client's list of available packages and publisher metadata for all
publishers.
.Bl -tag -width Ar
.It Ar publisher
Update the client's list of available packages and publisher metadata only
for the specified publishers.
.It Fl q
Hide progress messages during the requested operation.
.It Fl \-full
Force a full retrieval of all publisher metadata, instead of attempting an
incremental update, and request that any proxies used during the operation
ignore cached data.
This option exists for troubleshooting purposes and should not be used on a
regular basis.
.El
.Ed
.\" install
.Pp
.Nm
.Cm install
.Bk -words
.Op Fl nvq
.Op Fl C Ar n
.Oo Fl g Ar path_or_uri Oc Ns ...
.br
.Oo Fl r
.Oo Oo Fl z Ar zonename Oc Ns ... | Oo Fl Z Ar zonename Oc Ns ... Oc
.Oc
.br
.Op Fl \-accept
.Op Fl \-licenses
.Op Fl \-no-index
.Op Fl \-no-refresh
.br
.Op Fl \-no-be-activate | Fl \-temp-be-activate
.Op Fl \-no-backup-be | Fl \-require-backup-be
.Op Fl \-backup-be-name Ar name
.Op Fl \-deny-new-be | Fl \-require-new-be
.Op Fl \-be-name Ar name
.br
.Oo Fl \-reject Ar pkg_fmri_pattern Oc Ns ...
.Op Fl \-sync-actuators | Fl \-sync-actuators-timeout Ar timeout
.Ek
.br
.Ar pkg_fmri_pattern No ...
.Bd -ragged -offset Ds
Install and update the specified packages to the newest version that match
.Ar pkg_fmri_pattern
allowed by the packages installed in the image.
To explicitly request the latest version of a package, use
.Cm latest
for the version portion of
.Ar pkg_fmri_pattern .
For example, specify
.Cm vim@latest .
The
.Ar pkg_fmri_pattern
pattern can include the
.Sy \&?
and
.Sy *
characters as
.Xr glob 3C Ns -style
wildcards to match one or more packages.
.Pp
Versions older or newer than what is already installed can be specified to
perform in-place downgrades or upgrades of specific packages.
Updating specific packages across package rename or obsolete boundaries is not
supported.
.Pp
Any preserved configuration files that are part of packages to be downgraded
and that have been changed since the original version was installed are renamed
using the extension
.Pa .update .
For more information about how the package system determines which files to
preserve, and how these files are preserved during package upgrades, see "File
Actions" in the
.Xr pkg 5
man page.
.Pp
Packages are selected based on publisher search order and stickiness.
See the
.Nm
.Cm publisher
and
.Nm
.Cm set-publisher
commands for information about search order and stickiness.
If the
.Ar pkg_fmri_pattern
does not specify the publisher, the first publisher that provides a matching
package is used as the installation source.
If that publisher does not provide a version of the package that can be
installed in this image, then the installation operation fails.
Use the
.Nm
.Cm list Fl a
command to see which publishers provide a version of the package that can be
installed in this image.
.Pp
If more than one
.Ar pkg_fmri_pattern
is specified, and if any of the specified packages cannot be installed in this
image, then none of the specified packages will be installed.
.Pp
Some configuration files might be renamed or replaced during the installation
process.
For more information about how the package system determines which files to
preserve, and how they are preserved during package operations, see "File
Actions" in the
.Xr pkg 5
man page.
.Pp
If a package is on the avoid list, installing it removes it from that list.
.Bl -tag -width Ds
.It Fl C Ar n
Specify the number of child images to update in parallel.
When recursing into child images
.Po usually installed
.Sy lipkg ,
.Sy sparse
or
.Sy pkgsrc
branded non-global zones
.Pc ,
update at most
.Ar n
child images in parallel.
The default number of child images to update in parallel is
.Sy 1 .
If
.Ar n
is 0 or a negative number, all child images are updated in parallel.
See also
.Ev PKG_CONCURRENCY
in the
.Sx Environment Variables
section and
.Sy recursion-concurrency
in the
.Sx Image Properties
section.
.It Fl g Ar path_or_uri
Temporarily add the specified package repository or archive to the list of
sources in the image from which to retrieve package data.
Repositories that require a client SSL certificate cannot be used with this
option.
This option can be specified multiple times.
.Pp
When deciding which version of a package to use, publishers configured in the
image, but not found in the specified
.Ar path_or_uri
sources, take precedence.
If the version of the package to be installed is provided by a publisher
configured in the image and by a
.Ar path_or_uri
source, the client retrieves the content for that package from the
.Ar path_or_uri
sources.
After installation or update, any packages provided by publishers not
configured in the image are added to the image configuration without an origin.
Use the
.Nm
.Cm publisher
command to see which publishers are configured in the image.
.It Fl n
Perform a trial run of the operation with no package changes made.
.It Fl q
Hide progress messages during the requested operation.
.It Fl r
Run this operation in the global zone and also in all installed linked
non-global zones.
The effect on the non-global zone is similar to logging into each non-global
zone and running the command directly.
Without this option, when you run
.Nm
commands in the global zone, non-global zones are modified only to the extent
required to keep them compatible with the global zone.
With this option, the
.Nm
operation is applied to all installed non-global zones except as limited by the
.Fl z
and
.Fl Z
options.
Zones that are excluded by the
.Fl z
and
.Fl Z
options might still be modified if updates are required to keep them in sync
with the global zone.
.It Fl z Ar zonename
Run this operation only in the specified non-global zone.
The
.Fl z
option can be specified multiple times.
The
.Fl z
option can only be used with the
.Fl r
option.
The
.Fl z
option cannot be used with the
.Fl Z
option.
.It Fl Z Ar zonename
Run this operation in all non-global zones except for the specified zone.
The
.Fl Z
option can be specified multiple times.
The
.Fl Z
option can only be used with the
.Fl r
option.
The
.Fl Z
option cannot be used with the
.Fl z
option.
.It Fl v
Issue verbose progress messages during the requested operation, and display
detailed planning information (such as changing facets, mediators, and
variants).
.Pp
This option can be specified multiple times to increase the amount of planning
information displayed.
In particular, specifying this option twice in conjunction with the
.Cm install
or
.Cm update
sub-command, results in more detailed information about why that sub-command
cannot install or update the specified packages.
.It Fl \-accept
Indicate that you agree to and accept the terms of the licenses of the packages
that are updated or installed.
If you do not provide this option, and any package licenses require acceptance,
the installation operation fails.
.It Fl \-licenses
Display all of the licences for the packages that are installed or updated as
part of this operation.
For updated packages, display the licence only if the licence has changed.
.It Fl \-no-index
Do not update the search indexes after the operation has completed successfully.
.It Fl \-no-refresh
Do not attempt to contact the repositories for the image\&'s publishers to
retrieve the newest list of available packages and other metadata.
.It Fl \-no-be-activate
If a boot environment is created, do not set it as the active boot environment
on the next boot.
See the
.Xr beadm 1M
man page for more information.
.It Fl \-temp-be-activate
If a boot environment is created, set it as the active boot environment for the
next boot only (temporary activation).
See the
.Xr beadm 1M
man page for more information.
This is particularly useful for hosted environments where console access is not
readily available.
If the new boot environment boots successfully, it can be activated using
.Xr beadm 1M
and, if not, a power cycle will automatically revert to the previous boot
environment.
Temporary activation can be enabled by default for updates to an image via the
.Sy temp-be-activation
package property; if this is set then it is not necessary to specify the
.Fl \-temp-be-activate
option manually.
.It Fl \-no-backup-be
Do not create a backup boot environment.
.It Fl \-require-backup-be
Always create a backup boot environment if a new boot environment will not be
created.
Without this option, a backup boot environment is created based on image
policy.
See
.Sy be-policy
in
.Sx Image Properties
below for an explanation of when backup boot environments are created
automatically.
.It Fl \-backup-be-name Ar name
Name the created backup boot environment using the given argument.
Use of
.Fl -backup-be-name
implies
.Fl -require-backup-be .
See also the
.Xr beadm 1M
man page.
.It Fl \-deny-new-be
Do not create a new boot environment.
This operation will fail if this option is specified and the operation requires
a new boot environment.
.It Fl \-require-new-be
Always create a new boot environment.
Without this option, a boot environment is created based on image policy.
See
.Sy be-policy
in
.Sx Image Properties
below for an explanation of when boot environments are created automatically.
This option cannot be combined with
.Fl \-require-backup-be .
.It Fl \-be-name Ar name
Rename the newly created boot environment to be the argument given.
Use of
.Fl -be-name
implies
.Fl -require-new-be .
See also the
.Xr beadm 1M
man page.
.It Fl \-reject Ar pkg_fmri_pattern
Prevent packages with names matching the given pattern from being installed.
If matching packages are already installed, they are removed as part of this
operation.
Rejected packages that are the target of group dependencies are placed on the
avoid list.
This option can be specified multiple times.
.It Fl \-sync-actuators
Run SMF actuators synchronously.
The
.Nm
command will not return until all SMF actuators have finished in the zone in
which
.Nm
was invoked (the global zone or a non-global zone).
.It Fl \-sync-actuators-timeout
Run SMF actuators synchronously.
If the actuators do not finish within the given
.Ar timeout
in seconds,
.Nm
will continue operation and exit with return code 8.
.El
.Ed
.\" exact-install
.Pp
.Nm
.Cm exact-install
.Bk -words
.Op Fl nvq
.Op Fl C Ar n
.Oo Fl g Ar path_or_uri Oc Ns ...
.br
.Op Fl \-accept
.Op Fl \-licenses
.Op Fl \-no-index
.Op Fl \-no-refresh
.br
.Op Fl \-no-be-activate | Fl \-temp-be-activate
.Op Fl \-no-backup-be | Fl \-require-backup-be
.Op Fl \-backup-be-name Ar name
.Op Fl \-deny-new-be | Fl \-require-new-be
.Op Fl \-be-name Ar name
.br
.Oo Fl \-reject Ar pkg_fmri_pattern Oc Ns ...
.Ek
.br
.Ar pkg_fmri_pattern No ...
.Bd -ragged -offset Ds
Install or update the specified packages as if installing onto a bare system.
Any previously installed packages that are not specified on the command line
and are not a dependency of the specified packages will be removed.
This command ignores restrictions to not install packages that are on the avoid
list and not update packages that are on the frozen list.
Otherwise, this
.Cm exact-install
subcommand behaves the same way that the
.Cm install
subcommand behaves.
To explicitly request the latest version of a package, use
.Cm latest
for the version portion of
.Ar pkg_fmri_pattern .
For example, specify
.Cm vim@latest .
.Pp
Packages are selected based on publisher search order and stickiness.
See the
.Nm
.Cm publisher
and
.Nm
.Cm set-publisher
commands for information about search order and stickiness.
If the
.Ar pkg_fmri_pattern
does not specify the publisher, the first publisher that provides a matching
package is used as the installation source.
If that publisher does not provide a version of the package that can be
installed in this image, then the installation operation fails.
Use the
.Nm
.Cm list Fl a
command to see which publishers provide a version of the package that can be
installed in this image.
.Pp
If more than one
.Ar pkg_fmri_pattern
is specified, and if any of the specified packages cannot be installed in this
image, then none of the specified packages will be installed.
.Pp
Some configuration files might be renamed or replaced during the installation
process.
For more information about how the package system determines which files to
preserve, and how they are preserved during package operations, see "File
Actions" in the
.Xr pkg 5
man page.
.Pp
If a package is on the avoid list, installing it removes it from that list.
.Pp
For descriptions of options, see the
.Cm install
sub-command above.
.Ed
.\" uninstall
.Pp
.Nm
.Cm uninstall
.Bk -words
.Op Fl nvq
.Op Fl C Ar n
.br
.Oo Fl r
.Oo Oo Fl z Ar zonename Oc Ns ... | Oo Fl Z Ar zonename Oc Ns ... Oc
.Oc
.br
.Op Fl \-ignore-missing
.Op Fl \-no-index
.br
.Op Fl \-no-be-activate | Fl \-temp-be-activate
.Op Fl \-no-backup-be | Fl \-require-backup-be
.Op Fl \-backup-be-name Ar name
.Op Fl \-deny-new-be | Fl \-require-new-be
.Op Fl \-be-name Ar name
.br
.Op Fl \-sync-actuators | Fl \-sync-actuators-timeout Ar timeout
.Ek
.br
.Ar pkg_fmri_pattern No ...
.Bd -ragged -offset Ds
Remove installed packages that match
.Ar pkg_fmri_pattern .
.Pp
If a package is the subject of a group dependency, uninstalling it places it on
the avoid list.
See the
.Cm avoid
subcommand below.
.Pp
In the command output, note any messages that say a new boot environment has
been created.
If a new boot environment has been created and activated, that is the
environment that is booted by default on next reboot.
See the
.Xr beadm 1M
man page for information about managing boot environments.
.Bl -tag -width Ds
.It Fl \-ignore-missing
Ignore packages that are not installed.
Using this option prevents
.Nm
.Cm uninstall
from failing when attempting to uninstall a package that is not currently
installed.
.El
.Pp
For all other options, see the
.Cm install
command above.
.Ed
.\" update
.Pp
.Nm
.Cm update
.Bk -words
.Op Fl fnvq
.Op Fl C Ar n
.Oo Fl g Ar path_or_uri Oc Ns ...
.br
.Oo Fl R | Fl r
.Oo Oo Fl z Ar zonename Oc Ns ... | Oo Fl Z Ar zonename Oc Ns ... Oc
.Oc
.br
.Op Fl \-accept
.Op Fl \-ignore-missing
.Op Fl \-licenses
.Op Fl \-no-index
.Op Fl \-no-refresh
.br
.Op Fl \-no-be-activate | Fl \-temp-be-activate
.Op Fl \-no-backup-be | Fl \-require-backup-be
.Op Fl \-backup-be-name Ar name
.Op Fl \-deny-new-be | Fl \-require-new-be
.Op Fl \-be-name Ar name
.br
.Oo Fl \-reject Ar pkg_fmri_pattern Oc Ns ...
.br
.Op Fl \-sync-actuators | Fl \-sync-actuators-timeout Ar timeout
.Ek
.br
.Op Ar pkg_fmri_pattern No ...
.Bd -ragged -offset Ds
Update all packages installed in the current image to the newest version
allowed by the constraints imposed on the system by installed packages and
publisher configuration.
.Pp
In the command output, note any messages that say a new boot environment has
been created.
If a new boot environment has been created and activated, that is the
environment that is booted by default on next reboot if you do not specify the
.Fl \-no-be-activate
option.
See the
.Xr beadm 1M
man page for information about managing boot environments.
.Pp
Recursion can be enabled by default for updates to an image via the
.Sy default-recurse
image property; if this is set then it is not necessary
to specify the
.Fl r
option manually, however the
.Fl R
option can be specified to temporarily override recursion, see below.
.Bl -tag -width Ds
.It Ar pkg_fmri_pattern
Update only the specified packages installed in the current image.
If asterisk
.Pq Sy *
is one of the
.Ar pkg_fmri_pattern
patterns provided, update all packages installed in the current image in the
same way as when no
.Ar pkg_fmri_pattern
is provided.
.Pp
To explicitly request the latest version of a package, use
.Cm latest
for the version portion of
.Ar pkg_fmri_pattern .
For example, specify
.Cm vim@latest .
.Pp
Versions older or newer than what is already installed can be specified to
perform in-place downgrades or upgrades of specific packages.
Updating specific packages across package rename or obsolete boundaries is not
supported.
.Pp
Any preserved configuration files that are part of packages to be downgraded
and that have been changed since the original version was installed are renamed
using the extension
.Pa .update .
For more information about how the package system determines which files to
preserve, and how these files are preserved during package upgrades, see "File
Actions" in the
.Xr pkg 5
man page.
.Pp
If more than one
.Ar pkg_fmri_pattern
is specified, and if any of the specified packages cannot be updated in this
image, then none of the specified packages will be updated.
.It Fl f
Do not execute the client up-to-date check when updating all installed packages.
.It Fl \-ignore-missing
Ignore packages that are not installed.
Using this option prevents
.Nm
.Cm update
from failing when attempting to update a package that is not currently
installed.
.It Fl R
Disable recursion into linked non-global zones.
This option can be used to override the default policy set on the image, refer
to
.Sy default-recurse
in the
.Sx Package Properties
section.
Even with this option, when you run
.Nm
.Cm update
commands in the global zone, non-global zones are modified to the extent
required to keep them compatible with the global zone.
.El
.Pp
For all other options, see the
.Cm install
command above.
.Ed
.\" apply-hot-fix
.Pp
.Nm
.Cm apply-hot-fix
.Bk -words
.Op Fl nvq
.Op Fl C Ar n
.Oo Fl g Ar path_or_uri Oc Ns ...
.br
.Oo Fl R | Fl r
.Oo Oo Fl z Ar zonename Oc Ns ... | Oo Fl Z Ar zonename Oc Ns ... Oc
.Oc
.br
.Op Fl \-accept
.Op Fl \-ignore-missing
.Op Fl \-licenses
.Op Fl \-no-index
.Op Fl \-no-refresh
.br
.Op Fl \-no-be-activate | Fl \-temp-be-activate
.Op Fl \-no-backup-be | Fl \-require-backup-be
.Op Fl \-backup-be-name Ar name
.Op Fl \-deny-new-be | Fl \-require-new-be
.Op Fl \-be-name Ar name
.Ek
.br
.Ar path_or_uri
.Op Ar pkg_fmri_pattern No ...
.Bd -ragged -offset Ds
Install a hot-fix bundle from the provided location.
.Pp
In the command output, note any messages that say a new boot environment has
been created.
If a new boot environment has been created and activated, that is the
environment that is booted by default on next reboot if you do not specify the
.Fl \-no-be-activate
option.
See the
.Xr beadm 1M
man page for information about managing boot environments.
.Bl -tag -width Ds
.It Ar path_or_uri
Use the specified package repository or archive as the source of package data
for the operation.
Repositories that require a client SSL certificate cannot be used with this
option.
.It Ar pkg_fmri_pattern
Update only the specified packages found within the hot-fix archive.
.Pp
If more than one
.Ar pkg_fmri_pattern
is specified, and if any of the specified packages cannot be updated in this
image, then none of the specified packages will be updated.
.El
.Pp
For all other options, see the
.Cm install
command above.
.Ed
.\" autoremove
.Pp
.Nm
.Cm autoremove
.Bk -words
.Op Fl nvq
.Op Fl C Ar n
.br
.Oo Fl r
.Oo Oo Fl z Ar zonename Oc Ns ... | Oo Fl Z Ar zonename Oc Ns ... Oc
.Oc
.br
.Op Fl \-ignore-missing
.Op Fl \-no-index
.br
.Op Fl \-no-be-activate | Fl \-temp-be-activate
.Op Fl \-no-backup-be | Fl \-require-backup-be
.Op Fl \-backup-be-name Ar name
.Op Fl \-deny-new-be | Fl \-require-new-be
.Op Fl \-be-name Ar name
.Ek
.br
.Op Fl \-sync-actuators | Fl \-sync-actuators-timeout Ar timeout
.Bd -ragged -offset Ds
Automatically uninstall any packages which have no dependants and were not
installed manually.
The list of packages to be removed is the same as the list shown in the
output of
.Nm Cm list Fl rM .
.Pp
Packages are marked as manually installed if they were given as arguments to a
.Nm Cm install
command, or if they were flagged as manually installed using the
.Nm Cm flag Fl m
command.
Packages marked in this way are ignored by
.Cm autoremove .
.Ed
.\" list
.Pp
.Nm
.Cm list
.Bk -words
.Op Fl HafMmnqRrsuv
.Oo Fl g Ar path_or_uri Oc Ns ...
.Op Fl \-no-refresh
.Ek
.br
.Op Ar pkg_fmri_pattern No ...
.Bd -ragged -offset Ds
Display a list of all packages installed in the current image, including
information such as version and installed state.
By default, package variants for a different architecture or zone type are
excluded.
The usual output is in three columns:
.Ed
.Bd -literal -offset indent-two
NAME (PUBLISHER)                    VERSION           IFO
entire                              11-151037.0       i--
ooce/developer/cmake (extra.omnios) 3.19.5-151037.0   im-
.Ed
.Bd -ragged -offset Ds
The first column contains the name of the package.
If the publisher from which the package is installed (or available, if not
installed) is not the first in the publisher search order, then the publisher
name is listed in parentheses after the package name.
The second column contains the release and branch versions of the package.
See the
.Xr pkg 5
man page for information about release and branch versions and about variants.
.Pp
The last column contains a set of flags that show the status of the package:
.Bl -tag -offset Ds -width Ds
.It \&In the Sy I No column.
.Bl -tag -offset Ds -width Ds
.It Sy i
The package is installed
.El
.It \&In the Sy F No column.
.Bl -tag -offset Ds -width Ds
.It Sy f
The package is frozen.
.It Sy m
The package was manually installed.
.It Sy S
.Pq with the Fl R No flag
The package is removable but is part of the default system software set.
.El
.It \&In the Sy O No column.
.Bl -tag -offset Ds -width Ds
.It Sy o
The package is obsolete.
.It Sy r
The package has been renamed (a form of obsoletion).
.It Sy l
The package is
.Em legacy
and will be removed in a future release.
.El
.El
.Bl -tag -width Ds
.It Ar pkg_fmri_pattern
List only the specified packages.
.It Fl H
Omit the headers from the listing.
.It Fl a
List installed packages and list the newest version of packages that are not
installed but could be installed in this image.
Packages can be installed if they are allowed by the installed incorporations
and by the image's variants.
If one or more patterns are specified, then the newest version matching the
specified pattern and allowed by any installed incorporations and the image's
variants is listed.
Without
.Fl a ,
only installed packages are listed.
.It Fl af
List all versions of all packages for all variants regardless of incorporation
constraints or installed state.
To explicitly list the latest version of a package when using these options,
use
.Cm latest
for the version portion of
.Ar pkg_fmri_pattern .
For example, specify
.Cm vim@latest .
.It Fl g Ar path_or_uri
Use the specified package repository or archive as the source of package data
for the operation.
Repositories that require a client SSL certificate cannot be used with this
option.
This option can be specified multiple times.
Use of
.Fl g
implies
.Fl a
if
.Fl n
is not specified.
.It Fl M
Show only packages which were automatically
.Pq rather than manually
installed.
That is, those which are part of the default system or were installed
automatically as dependencies of another package.
.Pp
This can be usefully combined with
.Fl r
to show automatically installed packages which can likely be removed.
.It Fl m
Show only packages which were manually installed.
That is, those which were explicitly provided as arguments to a
.Nm Cm install
command, or were flagged using
.Nm Cm flag Fl m .
.It Fl n
Display the newest versions of all known packages, regardless of installed
state.
.It Fl q
Do not list any packages, but return failure if a fatal error occurs.
.It Fl r
List installed packages that are removable (i.e. those that have no dependants).
.It Fl R
List installed packages that are removable, like the
.Fl r
option above.
However,
.Fl R
also lists removable system packages, identifying them with a
.Sy S
in the
.Sy F
flags column.
.It Fl s
Display a one-line short-form giving the package name and summary.
This option can be used with
.Fl a ,
.Fl n ,
or
.Fl u .
.It Fl u
List installed packages that have newer versions available.
This option cannot be used with
.Fl g .
.It Fl v
Show full package FMRIs, including publisher and complete version, all in the
first column (the VERSION column disappears).
This option can be used with
.Fl a ,
.Fl n ,
or
.Fl u .
.It Fl \-no-refresh
Do not attempt to contact the repositories for the image's publishers to
retrieve the newest list of available packages.
.El
.Ed
.\" info
.Pp
.Nm
.Cm info
.Bk -words
.Op Fl lqr
.Oo Fl g Ar path_or_uri Oc Ns ...
.Op Fl \-license
.Ek
.Op Ar pkg_fmri_pattern No ...
.Bd -ragged -offset Ds
Display information about all packages installed in the current image in a
human-readable form.
.Bl -tag -width Ds
.It Ar pkg_fmri_pattern
Display information for only the specified packages.
.It Fl g Ar path_or_uri
Use the specified package repository or archive as the source of package data
for the operation.
Repositories that require a client SSL certificate cannot be used with this
option.
This option can be specified multiple times.
Use of
.Fl g
implies
.Fl r .
.It Fl l
Only display information for installed packages.
This is the default.
.It Fl q
Do not display any package information, but return failure if a fatal error
occurs.
.It Fl r
Match packages based on the newest available versions, retrieving information
for packages not currently installed (if necessary) from the repositories of
the image's configured publishers.
At least one package must be specified when using this option.
Without
.Fl r ,
only installed packages are displayed by default.
.It Fl \-license
Display the licence texts for the packages.
This option can be combined with
.Fl l ,
.Fl q ,
or
.Fl r .
Return success if all
.Ar pkg_fmri_pattern
patterns match known packages and have licenses.
Return failure if one or more patterns are unmatched or match packages that do
not have licenses.
.El
.Ed
.\" contents
.Pp
.Nm
.Cm contents
.Bk -words
.Op Fl Hmr
.Oo Fl a Ar attribute Ns = Ns Ar pattern Oc Ns ...
.Oo Fl g Ar path_or_uri Oc Ns ...
.Oo Fl o Ar attribute Ns Oo , Ns Ar attribute Oc Ns ... Oc Ns ...
.Op Fl s Ar sort_key
.Oo Fl t Ar action_name Ns Oo , Ns Ar action_name Oc Ns ... Oc Ns ...
.Op Ar pkg_fmri_pattern No ...
.Ek
.Bd -ragged -offset Ds
Display the contents (action attributes) of all packages installed in the
image.
With no options, display the value of the
.Sy path
attribute for actions installed in the current image, sorted alphabetically by
attribute value.
If the
.Fl o
option is not specified, the key attributes, as described in
.Xr pkg 5 ,
of the related action name will be displayed instead.
In addition,
.Sy depend
actions will also include the
.Sy type
attribute, and
.Sy set
actions will include the
.Sy value attribute .
.Pp
When more than one action name is specified, the default attributes are
the set of all attributes, as described above, of all the specified actions.
For information about actions and their attributes, see 'Actions' in the
.Xr pkg 5
man page.
See also the list of pseudo attribute names below.
.Bl -tag -width Ds
.It Ar pkg_fmri_pattern
Display contents of only the specified packages.
.It Fl H
Omit the headers from the output.
.It Fl a Ar attribute Ns = Ns Ar pattern
Limit the output to those actions that have an
.Ar attribute
named in the option argument with a value that matches the (glob)
.Ar pattern
in the option argument.
This option can be specified multiple times.
If multiple
.Fl a
options are given, then actions that match any of them are displayed.
.It Fl g Ar path_or_uri
Display information for packages that could be installed in this image from the
specified package repository or archive.
Repositories that require a client SSL certificate cannot be used with this
option.
Packages that could be installed include packages that are currently installed
and other packages that satisfy criteria for installation in this image, such
as variant and facet restrictions.
This option can be specified multiple times.
Use of
.Fl g
implies
.Fl r .
.It Fl m
Display all attributes of all actions in the specified packages, including
actions that could not be installed in this image.
.It Fl o Ar attribute
Display the specified attributes, sorted according to the values of the first
attribute listed.
The
.Fl o
option can be specified multiple times, or multiple attributes can be specified
as the argument to one
.Fl o
option by separating the attribute names with commas.
Only actions that have the requested attributes are displayed.
.It Fl r
Display information for the newest available versions of packages that could be
installed in this image from the repositories of the publishers configured in
this image.
Packages that could be installed include packages that are currently installed
and other packages that satisfy criteria for installation in this image, such
as variant and facet restrictions.
At least one package must be specified when using this option.
.It Fl s Ar sort_key
Sort actions by the specified action attribute.
If not provided, the default is to sort by path or by the first attribute
specified by the
.Fl o
option.
The
.Fl s
option can be specified multiple times.
.It Fl t Ar action_name
Only list the specified actions.
The
.Fl t
option can be specified multiple times, or multiple actions can be specified as
the argument to one
.Fl t
option by separating the action names with commas.
The value of
.Ar action_name
is one of the actions listed in "Actions" in the
.Xr pkg 5
man page, such as
.Sy file ,
.Sy directory ,
.Sy driver ,
.Sy depend ,
.Sy set .
.El
.Pp
Several special pseudo attribute names are available for convenience:
.Bl -tag -width 1
.It Sy action.hash
The value of the action's hash, if the action carries a payload.
.It Sy action.key
The value of the action's key attribute.
For example, for a
.Sy file
action, the key attribute is the path to the file.
Some actions do not have a key attribute.
.It Sy action.name
The name of the action.
For example, for a file action, this is
.Sy file .
.It Sy action.raw
All attributes of matching actions.
.It Sy pkg.fmri
The full FMRI of the package containing the action, such as
.Sy pkg://omnios/entire@11-151036.0:20201029T154929Z .
.It Sy pkg.name
The name of the package containing the action, such as
.Sy entire .
.It Sy pkg.publisher
The publisher of the package containing the action, such as
.Sy omnios .
.It Sy pkg.shortfmri
The short form FMRI of the package containing the action, such as
.Sy pkg://omnios/entire@11-151036.0 .
.El
.Pp
The
.Cm contents
and
.Cm search
subcommands are related; both query the system for the contents of packages.
The
.Cm contents
subcommand displays actions in one or more installed or installable packages,
filtering the output based on the specified options.
The
.Cm search
subcommand approaches the query from the other direction, displaying the names
of all packages that contain a user-supplied token.
.Pp
Each subcommand is capable of formulating some queries of which the other is
capable.
Care should be taken in choosing the subcommand, as a given query can be more
naturally formulated in one than in the other.
.Ed
.\" search
.Pp
.Nm
.Cm search
.Bk -words
.Op Fl HIaflpr
.Oo Fl o Ar attribute Ns Oo , Ns Ar attribute Oc Ns ... Oc Ns ...
.Op Fl s Ar repo_uri
.Ek
.Ar query
.Bd -ragged -offset Ds
Search for actions that match
.Ar query ,
and display the matching search index, action name, action value, and package
name.
See the description of
.Ar query
below.
Some searches might yield duplicate results.
.Bl -tag -width Ds
.It Fl H
Omit the headers from the output.
.It Fl I
Use a case-sensitive search.
.It Fl a
Perform the search and display information about the matching actions.
This is the default.
.It Fl f
Show all results, regardless of package version.
By default,
.Cm search
prunes results from packages older than the currently installed version and
from package versions excluded by current incorporations.
.It Fl l
Search the image's installed packages.
.Pp
Both
.Fl l
and
.Fl r
.Pq or Fl s
can be specified together, in which case both local and remote searches are
performed.
.It Fl o Ar attribute
Specify the columns to include in the output.
The
.Fl o
option can be specified multiple times, or multiple attributes can be specified
as the argument to one
.Fl o
option by separating the attribute names with commas.
In addition to the pseudo attributes outlined above, the following attributes
are defined for search results.
These attributes help show why a particular result was a match:
.Bl -tag -width 1
.It search.match
The string that matched the search query.
.It search.match_type
The attribute that contained the string that matched the search query.
.El
.It Fl p
Display packages that have some actions that match each query term.
Using this option is equivalent to putting angle brackets
.Pq Aq \&
around each term in the query.
See
.Ar query
below for more description of the
.Aq \&
operator.
.It Fl r
Search the repositories corresponding to the image's publishers.
This is the default.
.Pp
Both
.Fl l
and
.Fl r
.Pq or Fl s
can be specified together, in which case both local and remote searches are
performed.
.It Fl s Ar repo_uri
Search the
.Nm
repository located at the given URI.
This can be specified multiple times.
Package archives are not supported.
.It Ar query
By default,
.Ar query
is interpreted as a series of terms to be matched exactly and multiple terms
are ANDed.
.Pp
AND and OR are supported.
.Pp
The
.Sy \&?
and
.Sy \&*
characters can be used as
.Xr glob 3C Ns -
style wildcards, allowing more flexible query matches.
.Pp
In addition to simple token matching and wildcard search, a more complicated
query language is supported.
Phrases can be searched for by using single or double quotation marks
.Pq Sy \&' No or Sy \(dq .
Be sure to take your shell into account so that
.Nm
actually sees these characters.
.Pp
Which tokens are indexed is action-dependent, but can include content hashes
and path names.
For information about actions and their attributes, see "Actions" in the
.Xr pkg 5
man page.
See also the list of pseudo attribute names in
.Nm
.Cm contents
and
.Fl o
above.
.Pp
Structured queries are supported with the following syntax:
.Sm off
.Pp
.D1 Ar pkg_name : Ar action_name : Ar index : Ar token
.Pp
.Sm on
The value of
.Ar action_name
is one of the actions listed in "Actions" in the
.Xr pkg 5
man page.
The
.Ar index
is an attribute of the action.
The value of
.Ar index
must match
.Ar token .
.Pp
Not all action attributes are searchable.
For example,
.Sy mode
is an attribute of the
.Sy file
action, but
.Sy mode
is not a valid value for
.Ar index .
.Pp
Some values for
.Ar index
are not action attributes but are values derived from other attributes.
For example,
.Ar index
can be
.Sy basename ,
which is not an attribute of any action but is derived from the
.Sy path
attribute of the
.Sy file
or
.Sy dir
action by taking the last component of the path.
.Pp
Different action types have different valid values for
.Ar index .
This documentation does not list all possible values.
Some of the more useful
.Ar index
values are
.Sy basename
and
.Sy path
for file system actions, the dependency type
.Pq for example, Sy require , Sy optional , Sy group
for
.Sy depend
actions, and
.Sy driver_name
and
.Sy alias
for
.Sy driver
actions.
.Pp
One special value for
.Ar index
is the value of a
.Sy name
attribute for a
.Sy set
action.
In this case,
.Ar token
is matched against the value of the
.Sy value
attribute that corresponds to the specified
.Sy name
attribute.
For example, the following search finds packages that are classified as either
Development/Databases or System/Databases.
In the
.Sx Examples
section, see the example of finding SMF services.
.Bd -literal -offset xxxx
$ pkg search info.classification:databases
.Ed
.Pp
Missing fields in a structured query are implicitly wildcarded.
A search for
.Sy basename:pkg
matches all actions in all packages that have an
.Ar index
of
.Sy basename
and that match the
.Ar token
pkg, as shown in the following partial output:
.Bd -literal -offset xxxx
$ pkg search basename:pkg
INDEX    ACTION VALUE         PACKAGE
basename dir    usr/share/pkg pkg:/package/pkg@0.5.11
basename dir    var/sadm/pkg  pkg:/package/svr4@0.5.11
basename dir    var/spool/pkg pkg:/package/svr4@0.5.11
basename file   usr/bin/pkg   pkg:/package/pkg@0.5.11
.Ed
.Pp
Adding another field narrows the search, as shown in the following complete
output:
.Bd -literal -offset xxxx
$ pkg search file:basename:pkg
INDEX    ACTION VALUE       PACKAGE
basename file   usr/bin/pkg pkg:/package/pkg@0.5.11
.Ed
.Pp
Explicit wildcards are supported in the
.Ar pkg_name
and
.Ar token
fields.
The
.Ar action_name
and
.Ar index
must match exactly.
.Pp
See the
.Sx Examples
section for examples of searching for files and dependencies.
.Pp
To convert actions to the packages that contain those actions, use
.Aq \& ,
as shown in the following partial output:
.Bd -literal -offset xxxx
$ pkg search \e<pkg\e>
PACKAGE                             PUBLISHER
pkg:/package/pkg@0.5.11-151036.0    omnios
pkg:/package/svr4@0.5.11-151036.0   omnios
.Ed
.Pp
With the
.Fl a
option (and by default), searching for
.Sy token
results in information about the actions that match
.Sy token ,
while searching for
.Aq token
results in a list of packages that contain actions that match
.Sy token .
.El
.Ed
.\" verify
.Pp
.Nm
.Cm verify
.Bk -words
.Op Fl Hqv
.Op Fl p Ar path
.Op Fl \-parsable Ar version
.Op Fl \-unpackaged | Fl \-unpackaged-only
.Ek
.Op Ar pkg_fmri_pattern No ...
.Bd -ragged -offset Ds
Validate the installation of all packages installed in the current image.
If current signature policy for related publishers is not
.Sy ignore ,
the signatures of each package are validated based on policy.
See
.Sy signature-policy
in
.Sx Image Properties
below for an explanation of how signature policies are applied.
.Bl -tag -width Ds
.It Ar pkg_fmri_pattern
Validate the installation of only the specified packages installed in the
current image.
When used with
.Fl p ,
only the maching actions from the specified packages will be verified.
.It Fl H
Omit the headers from the verification output.
.It Fl p Ar path
Validate individual files, links or directories by specifying the paths.
Paths specified are assumed to be relative to the root of the image on which the
verify is performed.
If a directory or a link is specified, only the matching action for the
directory or the link will be verified.
.Pp
If no
.Ar pkg_fmri_pattern Ns s
are provided when specifying paths, all matching actions from packages
installed in the image will be verified.
.It Fl \-parsable Ar version
Parsable output; the supported version is 0.
Use of this option implies
.Fl q .
.It Fl q
Suppress progress messages and all other output during the requested operation.
.It Fl \-unpackaged
Report unpackaged contents in addition to general output.
Current unpackaged contents includes unpackaged files and unpackaged
directories.
This option can be combined with
.Fl \-parsable .
.It Fl \-unpackaged-only
Report only unpackaged contents.
This option excludes general verification output and only reports the
unpackaged files and directories.
This option can be combined with
.Fl \-parsable .
.It Fl v
Include informational messages regarding packages.
.El
.Ed
.\" fix
.Pp
.Nm
.Cm fix
.Bk -words
.Op Fl nvq
.Op Fl \-accept
.Op Fl \-licenses
.br
.Op Fl \-no-be-activate | Fl \-temp-be-activate
.Op Fl \-no-backup-be | Fl \-require-backup-be
.Op Fl \-backup-be-name Ar name
.Op Fl \-deny-new-be | Fl \-require-new-be
.Op Fl \-be-name Ar name
.br
.Op Fl \-parsable Ar version
.Op Fl \-unpackaged
.Op Ar pkg_fmri_pattern No ...
.Ek
.Bd -ragged -offset Ds
Fix any errors reported by
.Nm
.Cm verify .
Verification of installed package content is based on a custom content analysis
that might return different results than those of other programs.
.Bl -tag -width Ds
.It Ar pkg_fmri_pattern
Fix errors reported by
.Nm
.Cm verify
for only the specified packages installed in the current image.
.It Fl \-accept
Indicate that you agree to and accept the terms of the licenses of the packages
that are updated or installed.
If you do not provide this option, and any package licenses require acceptance,
the operation fails.
.It Fl \-licenses
Display all of the licenses for the packages that are installed or updated as
part of this operation.
For updated packages, display the license only if the license has changed.
.It Fl \-parsable Ar version
Parsable output; the supported version is 0.
Use of this option implies
.Fl q .
.It Fl \-unpackaged
Report unpackaged contents in addition to general output.
.El
.Pp
For all other options, see the
.Cm install
command above.
.Ed
.\" revert
.Pp
.Nm
.Cm revert
.Bk -words
.Op Fl nv
.br
.Op Fl \-no-be-activate | Fl \-temp-be-activate
.Op Fl \-no-backup-be | Fl \-require-backup-be
.Op Fl \-backup-be-name Ar name
.Op Fl \-deny-new-be | Fl \-require-new-be
.Op Fl \-be-name Ar name
.br
.Ek
.Pq Fl \-tagged Ar tag_name No ... | Ar path_to_file No ...
.Bd -ragged -offset Ds
Revert files delivered by packages to their as-delivered condition.
File ownership and protections are also restored.
.Sy Caution -
Reverting some editable files to their default values can make the system
unbootable, or cause other malfunctions.
.Bl -tag -width Ds
.It Fl \-tagged Ar tag-name
Revert all files tagged with
.Ar tag-name ,
and remove any unpackaged files or directories that are under directories with
this tag and that match
.Ar pattern .
See the description of the
.Sy revert-tag
attribute in "File Actions" and "Directory Actions" in the
.Xr pkg 5
man page for more information about
.Sy tag-name
and
.Ar pattern .
.It Ar path-to-file
Revert the specified files.
.El
.Pp
For all other options, see the
.Cm install
command above.
.Ed
.\" mediator
.Pp
.Nm
.Cm mediator
.Bk -words
.Op Fl aH
.Op Fl F Ar format
.Op Ar mediator No ...
.Ek
.Bd -ragged -offset Ds
Display the current selected version and/or implementation of all mediators.
.Bl -tag -width Ds
.It Ar mediator
Display the current selected version and/or implementation of only the
specified mediators.
.It Fl F Ar format
Specify an alternative output format.
The value of
.Ar format
can be
.Sy tsv
.Pq Tab Separated Values ,
.Sy json
.Pq JavaScript Object Notation as a single line ,
or
.Sy json-formatted
.Pq JavaScript Object Notation, formatted for readability .
.It Fl H
Omit the headers from the listing.
.It Fl a
List the mediations that can be set for currently installed packages.
.El
.Ed
.\" set-medaitor
.Pp
.Nm
.Cm set-mediator
.Bk -words
.Op Fl nv
.Op Fl I Ar implementation
.Op Fl V Ar version
.br
.Op Fl \-no-be-activate | Fl \-temp-be-activate
.Op Fl \-no-backup-be | Fl \-require-backup-be
.Op Fl \-backup-be-name Ar name
.Op Fl \-deny-new-be | Fl \-require-new-be
.Op Fl \-be-name Ar name
.Ar mediator No ...
.Ek
.Bd -ragged -offset Ds
set the version and/or implementation for the specified mediators in the
current image.
.Bl -tag -width Ds
.It Fl I Ar implementation
Set the implementation of the mediated interface to use.
By default, if no version is specified, all implementation versions are allowed.
To specify an implementation with no version, append an at sign (@).
.It Fl V Ar version
Set the version of the mediated interface to use.
.El
.Pp
If the specified mediator version and/or implementation is not currently
available, any links using the specified mediators are removed.
.Pp
For all other options, see the
.Cm install
command above.
.Ed
.\" unset-mediator
.Pp
.Nm
.Cm unset-mediator
.Bk -words
.Op Fl nvIV
.br
.Op Fl \-no-be-activate | Fl \-temp-be-activate
.Op Fl \-no-backup-be | Fl \-require-backup-be
.Op Fl \-backup-be-name Ar name
.Op Fl \-deny-new-be | Fl \-require-new-be
.Op Fl \-be-name Ar name
.Ar mediator No ...
.Ek
.Bd -ragged -offset Ds
Revert the version and/or implementation of the specified mediators to the
system default.
.Bl -tag -width Ds
.It Fl I
Revert only the implementation of the mediated interface.
.It Fl V
Revert only the version of the mediated interface.
.El
.Pp
For all other options, see the
.Cm install
command above.
.Ed
.\" variant
.Pp
.Nm
.Cm variant
.Op Fl HAiv
.Op Fl F Ar format
.Op Ar variant_pattern No ...
.Bd -ragged -offset Ds
Display the current values of all variants set in this image.
See "Facets and Variants" in the
.Xr pkg 5
man page for more information about variants.
.Bl -tag -width Ds
.It Ar variant_pattern
Display the current values of only the specified variants set in this image.
.It Fl F Ar format
Specify an alternative output format.
For a description, see the
.Nm
.Cm mediator
command.
.It Fl H
Omit the headers from the listing.
.It Fl a
Display all variants explicitly set in the image and all variants that are
listed in installed packages.
The
.Fl a
option cannot be combined with the
.Fl i
option.
.It Fl i
Display all variants that are listed in installed packages.
The
.Fl i
option cannot be combined with the
.Fl a
option.
.It Fl v
Display the possible variant values that can be set for installed packages.
The
.Fl v
option can be combined with the
.Fl a
or
.Fl i
options.
.El
.Ed
.\" change-variant
.Pp
.Nm
.Cm change-variant
.Bk -words
.Op Fl nvq
.Op Fl C Ar n
.Oo Fl g Ar path_or_uri Oc Ns ...
.br
.Oo Fl R | Fl r
.Oo Oo Fl z Ar zonename Oc Ns ... | Oo Fl Z Ar zonename Oc Ns ... Oc
.Oc
.br
.Op Fl \-accept
.Op Fl \-licenses
.br
.Op Fl \-no-be-activate | Fl \-temp-be-activate
.Op Fl \-no-backup-be | Fl \-require-backup-be
.Op Fl \-backup-be-name Ar name
.Op Fl \-deny-new-be | Fl \-require-new-be
.Op Fl \-be-name Ar name
.br
.Op Fl \-sync-actuators | Fl \-sync-actuators-timeout Ar timeout
.Ek
.br
.Ar variant_name Ns = Ns Ar value No ...
.Bd -ragged -offset Ds
Change the values of the specified variants set in the current image.
.Pp
Changing the value of a variant can cause package content to be removed,
updated, or installed.
Changing a variant value can also cause entire packages to be installed,
updated, or removed to satisfy the new image configuration.
See "Facets and Variants" in the
.Xr pkg 5
man page for more information about variants.
.Pp
For descriptions of the options, see the
.Cm install
command above.
.Ed
.\" facet
.Pp
.Nm
.Cm facet
.Op Fl Haim
.Op Fl F Ar format
.Op Ar facet_pattern No ...
.Bd -ragged -offset Ds
Display the current values and source of all facets that either have been set
locally in this image by using the
.Nm
.Cm change-facet
command or have been inherited from a parent image (such as a non-global zone
inheriting the facet setting from the global zone).
See "Facets and Variants" in the
.Xr pkg 5
man page for more information about facets.
.Bl -tag -width Ds
.It Ar facet_pattern
Display the current values of only the specified facets set in this image.
.It Fl F Ar format
Specify an alternative output format.
For a description, see the
.Nm
.Cm mediator
command.
.It Fl H
Omit the headers from the listing.
.It Fl a
Display all facets explicitly set in the image and all facets that are listed
in installed packages.
The
.Fl a
option cannot be combined with the
.Fl i
option.
.It Fl i
Display all facets that are listed in installed packages.
The
.Fl i
option cannot be combined with the
.Fl a
option.
.It Fl m
Include masked facets in the output.
Display a column that indicates which, if any, facets are masked.
Masked facets are facets set locally in an image (by using the
.Nm
.Cm change-facet
command) that are hidden by an inherited facet with the same name.
.El
.Ed
.\" change-facet
.Pp
.Nm
.Cm change-facet
.Bk -words
.Op Fl nvq
.Op Fl C Ar n
.Oo Fl g Ar path_or_uri Oc Ns ...
.br
.Oo Fl R | Fl r
.Oo Oo Fl z Ar zonename Oc Ns ... | Oo Fl Z Ar zonename Oc Ns ... Oc
.Oc
.br
.Op Fl \-accept
.Op Fl \-licenses
.br
.Op Fl \-no-be-activate | Fl \-temp-be-activate
.Op Fl \-no-backup-be | Fl \-require-backup-be
.Op Fl \-backup-be-name Ar name
.Op Fl \-deny-new-be | Fl \-require-new-be
.Op Fl \-be-name Ar name
.br
.Op Fl \-sync-actuators | Fl \-sync-actuators-timeout Ar timeout
.br
.Ar facet_name Ns = Ns
.Sm off
.Pq Cm True | Cm False | Cm None
.Sm on
.Ek
.No ...
.Bd -ragged -offset Ds
Change the values of the specified facets set in the current image.
The changes also appear in any images that inherit these facets, such as
non-global zones.
.Pp
Facets can be set to
.Sy True
or
.Sy False .
Setting a facet to
.Sy None
applies the default value of
.Sy True
to that facet; thus, any actions subject to the facet will be installed.
See "Actions" in the
.Xr pkg 5
man page for information about actions.
.Pp
Changing the value of a facet can cause package content to be removed, updated,
or installed.
Changing a facet value can also cause entire packages to be installed, updated,
or removed to satisfy the new image configuration.
See "Facets and Variants" in the
.Xr pkg 5
man page for more information about facets.
.Pp
For dscriptions of the options, see the
.Cm install
command above.
.Ed
.\" avoid
.Pp
.Nm
.Cm avoid
.Op Ar pkg_fmri_pattern No ...
.Bd -ragged -offset Ds
Display each avoided package along with any packages that have a group
dependency on that package.
.Pp
Packages that are on the avoid list are installed if needed to satisfy a
required dependency.
If that dependency is removed, the package is uninstalled.
.Bl -tag -width Ds
.It Ar pkg_fmri_pattern
Avoid the specified packages if they are the target of a group dependency by
placing the package names that currently match the specified patterns on the
avoid list.
Only packages that are not currently installed can be avoided.
If a package is currently the target of a group dependency, uninstalling the
package places it on the avoid list.
.El
.Ed
.\" unavoid
.Pp
.Nm
.Cm unavoid
.Op Ar pkg_fmri_pattern No ...
.Bd -ragged -offset Ds
Display the list of avoided packages.
.Bl -tag -width Ds
.It Ar pkg_fmri_pattern
Remove the specified packages from the avoid list.
Packages on the avoid list that match an installed package's group dependency
cannot be removed using this subcommand.
To remove a package from the avoid list that matches a group dependency,
install the package.
.El
.Ed
.\" freeze
.Pp
.Nm
.Cm freeze
.Op Fl n
.Op Fl c Ar reason
.Op Ar pkg_fmri_pattern No ...
.Bd -ragged -offset Ds
Display information about currently frozen packages: package names, versions,
when the package was frozen, and any associated reasons for freezing the
packages.
.Pp
Freezing a package does not prevent removal of the package.
No warning is displayed if the package is removed.
.Bl -tag -width Ds
.It Ar pkg_fmri_pattern
Freeze the specified packages to the specified versions.
If no version is given, the package must be installed and is frozen at that
installed version.
Freezing a package that is already frozen replaces the freeze version with the
newly specified version.
.Pp
When a package that is frozen is installed or updated, it must end up at a
version that matches the version at which it was frozen.
For example, if a package was frozen at 1.2, then it could be updated to 1.2.1,
1.2.9, 1.2.0.0.1, and so on.
That package could not end up at 1.3, or 1.1.
A publisher presented in the
.Ar pkg_fmri_pattern
is used to find matching packages.
However, publisher information is not recorded as part of the freeze.
A package is frozen with respect to its version only, not its publisher.
.It Fl c Ar reason
Record the
.Ar reason
with the packages that are frozen.
The reason is shown if a freeze prevents an installation or update from
succeeding.
.It Fl n
Perform a trial run of the freeze operation, displaying the list of packages
that would be frozen without freezing any packages.
.El
.Ed
.\" unfreeze
.Pp
.Nm
.Cm unfreeze
.Op Fl n
.Op Ar pkg_fmri_pattern No ...
.Bd -ragged -offset Ds
Display information about currently frozen packages: package names, versions,
when the package was frozen, and any associated reasons for freezing the
packages.
.Bl -tag -width Ds
.It Ar pkg_fmri_pattern
Remove the constraints that freezing imposes from the specified packages.
Any versions provided are ignored.
.It Fl n
Perform a trial run of the unfreeze operation, displaying the list of packages
that would be unfrozen without unfreezing any packages.
.El
.Ed
.\" flag
.Pp
.Nm
.Cm flag
.Op Fl mM
.Op Ar pkg_fmri_pattern No ...
.Bd -ragged -offset Ds
Set or unset flags on installed packages as specified by the options shown
below.
.Bl -tag -width Ds
.It Ar pkg_fmri_pattern
Set or unset the flag on the specified installed packages.
Any versions provided are ignored.
.It Fl m
Flag the package as manually installed.
.It Fl M
Remove the manually installed flag from the package.
.El
.Ed
.\" clean
.Pp
.Nm
.Cm clean
.Op Fl v
.Bd -ragged -offset Ds
Clean the downloaded package content cache.
To automatically clear the content cache after each successful image-modifying
operation, see
.Sy flush-content-cache-on-success
in
.Sx IMAGE PROPERTIES
below.
.Bl -tag -width Ds
.It Fl v
Produce verbose output.
.El
.Ed
.\" property
.Pp
.Nm
.Cm property
.Op Fl H
.Op Ar propname No ...
.Bd -ragged -offset Ds
Display the names and values of all image properties.
See
.Sx Image Properties
below for descriptions of image properties.
.Bl -tag -width Ds
.It Ar propname
Display the names and values for only the specified properties.
.It Fl H
Omit the headers from the listing.
.El
.Ed
.\" set-property
.Pp
.Nm
.Cm set-property
.Ar propname propvalue
.Bd -ragged -offset Ds
Update an existing image property or add a new image property.
.Ed
.\" add-property-value
.Pp
.Nm
.Cm add-property-value
.Ar propname propvalue
.Bd -ragged -offset Ds
Add a value to an existing image property or add a new image property.
.Ed
.\" remove-property-value
.Pp
.Nm
.Cm remove-property-value
.Ar propname propvalue
.Bd -ragged -offset Ds
Remove a value from an existing image property.
.Ed
.\" unset-property
.Pp
.Nm
.Cm unset-property
.Ar propname No ...
.Bd -ragged -offset Ds
Remove an existing image property or properties.
.Ed
.\" publisher
.Pp
.Nm
.Cm publisher
.Op Fl HPn
.Op Fl F Ar format
.Op Ar publisher No ...
.Bd -ragged -offset Ds
Display the list of all publishers in order of search preference.
The following information is displayed for each publisher: name, attributes
such as non-sticky and disabled, type (origin or mirror), online status, proxy,
and location URI.
Proxy information is shown only as T (true) or F (false) under the column
labeled P.
To show the proxy value for a publisher with T in the P column, use the
.Fl F Cm tsv
option or specify the publisher name argument.
Proxies shown by the
.Nm
.Cm publisher
command were set by using the
.Fl -proxy
option of the
.Nm
.Cm set-publisher
command.
Proxies set by using an
.Ev http_proxy
environment variable are not shown by the
.Nm
.Cm publisher
command.
.Bl -tag -width Ds
.It Ar publisher
Display detailed configuration for only the specified publishers.
Additional information displayed includes the proxy URI, key, and certificate
for each origin or mirror URI, the client UUID, and the time the catalog was
last updated.
.It Fl F Ar format
Specify an alternative output format.
The value of
.Ar format
can only be
.Cm tsv
(Tab Separated Values).
.It Fl H
Omit the headers from the listing.
.It Fl P
Display only the first publisher in the publisher search order.
.It Fl n
Display only enabled publishers.
.El
.Ed
.\" set-publisher
.Pp
.Nm
.Cm set-publisher
.Bk -words
.Op Fl Pedv
.Op Fl c Ar ssl_cert
.Op Fl k Ar ssl_key
.Op Fl O Ar origin_to_set | Fl \-origin-uri Ar origin_to_set
.Op Fl g Ar origin_to_add | Fl \-add-origin Ar origin_to_add
.Op Fl G Ar origin_to_remove | Fl \-remove-origin Ar origin_to_remove
.Op Fl m Ar mirror_to_add | Fl \-add-mirror Ar mirror_to_add
.Op Fl M Ar mirror_to_remove | Fl \-remove-mirror Ar mirror_to_remove
.br
.Oo Fl R | Fl r
.Oo Oo Fl z Ar zonename Oc Ns ... | Oo Fl Z Ar zonename Oc Ns ... Oc
.Oc
.br
.Op Fl \-disable
.Op Fl \-enable
.Op Fl \-refresh
.Op Fl \-reset-uuid
.Op Fl \-sticky
.Op Fl \-non-sticky
.Op Fl \-search-first
.Op Fl \-search-before Ar publisher
.Op Fl \-search-after Ar publisher
.Op Fl \-approve-ca-cert Ar path_to_CA
.Op Fl \-revoke-ca-cert Ar hash_of_CA_to_remove
.Op Fl \-unset-ca-cert Ar hash_of_CA_to_remove
.Op Fl \-set-property Ar name_of_property Ns = Ns Ar value
.Op Fl \-add-property-value Ar name_of_property Ns = Ns Ar value_to_add
.Op Fl \-remove-property-value Ar name_of_property Ns = Ns Ar value_to_remove
.Op Fl \-unset-property Ar name_of_property_to_delete
.Op Fl \-proxy Ar proxy_to_use
.Ek
.br
.Ar publisher
.Bd -ragged -offset Ds
Update an existing publisher or add a publisher.
If no options affecting search order are specified, new publishers are appended
to the search order and are thus searched last.
.Bl -tag -width Ds
.It Fl G Ar origin_to_remove | Fl \-remove-origin Ar origin_to_remove
Remove the URI or path from the list of origins for the given publisher.
The special value
.Sy *
can be used to remove all origins.
.It Fl M Ar mirror_to_remove | Fl \-remove-mirror Ar mirror_to_remove
Remove the URI from the list of mirrors for the given publisher.
The special value
.Sy *
can be used to remove all mirrors.
.It Fl O Ar origin_to_set | Fl \-origin-uri Ar origin_to_set
Remove all existing origins for the given publisher and set a single new one.
If a client SSL key/certificate is configured and the new origin transport is
https, then the SSL information will be retained in the publisher.
.It Fl r
Run this operation in the global zone and also in all installed linked
non-global zones.
The effect on the non-global zone is similar to logging into
each non-global zone and running the command directly.
.It Fl z Ar zonename
Run this operation only in the specified non-global zone.
The
.Fl z
option can be specified multiple times.
The
.Fl z
option can only be used with the
.Fl r
option.
The
.Fl z
option cannot be used with the
.Fl Z
option.
.It Fl Z Ar zonename
Run this operation in all non-global zones except for the specified zone.
The
.Fl Z
option can be specified multiple times.
The
.Fl Z
option can only be used with the
.Fl r
option.
The
.Fl Z
option cannot be used with the
.Fl z
option.
.It Fl P | Fl \-search-first
Set the specified publisher first in the search order.
When installing new packages, this publisher is searched first.
Updates to already installed packages come from the same publisher that
originally provided the package as long as that publisher remains sticky.
.It Fl c Ar ssl_cert
Specify the client SSL certificate.
.It Fl d | Fl \-disable
Disable the publisher.
A disabled publisher is not used when populating the package list or in certain
package operations (install, uninstall, and update).
However, the properties for a disabled publisher can still be set and viewed.
If only one publisher exists, it cannot be disabled.
.It Fl e | Fl \-enable
Enable the publisher.
.It Fl g Ar origin_to_add | Fl \-add-origin Ar origin_to_add
Add the specified URI or path as an origin for the given publisher.
This should be the location of a package repository or archive.
If combined with
.Fl \-enable
or
.Fl \-disable ,
the origins will be enabled or disabled as specified.
In this case,
.Cm *
can be used to enable or disable all origins.
.It Fl k Ar ssl_key
Specify the client SSL key.
.It Fl m Ar mirror_to_add | Fl \-add-mirror Ar mirror_to_add
Add the URI as a mirror for the given publisher.
.It Fl \-add-property-value Ar name Ns = Ns Ar value
Add a value to an existing publisher property or add a new publisher property.
.It Fl \-approve-ca-cert Ar path-to-CA
For verifying signed packages, add the specified certificate as a CA
certificate that is trusted.
The hashes of the PEM representation of the user-approved CA certificates are
listed in the detailed output of the
.Nm
.Cm publisher
command.
.It Fl \-no-refresh
Do not attempt to contact the repositories for the image's publishers to
retrieve the newest list of available packages and other metadata.
.It Fl \-non-sticky
Higher ranked publishers than this one can provide updates to packages
originally installed from this publisher.
.It Fl \-proxy Ar proxy_to_use
Use the specified proxy URI to retrieve content for the specified origin (
.Pq Fl g
or mirror
.Pq Fl m .
The proxy value is stored as part of the publisher configuration, which means
the system repository used by child images is automatically updated.
This option cannot be used to set an authenticated proxy.
The
.Ar proxy_to_use
value cannot have the form
.Sy protocol://user:password@host .
.Pp
At run time,
.Ev http_proxy
or related environment variables override this proxy setting.
See the "Environment" section of the
.Xr curl 1
man page for the list of accepted environment variable names.
If you use an environment variable to set the proxy URI, you must also set the
appropriate proxy property of the
.Sy svc:/application/pkg/system-repository
SMF service to the same value.
.It Fl \-remove-property-value
Remove a value from an existing publisher property.
.It Fl \-reset-uuid
Choose a new unique identifier that identifies this image to its publisher.
.It Fl \-revoke-ca-cert Ar CA_hash
For verifying signed packages, treat the certificate with the given hash of its
PEM representation as revoked.
The hashes of the user-revoked CA certificates are listed in the detailed
output of the
.Nm
.Cm publisher
command.
.It Fl \-search-after Ar publisher
Alter the publisher search order so that the publisher being added or modified
is searched after the publisher specified in this option.
.It Fl \-search-before Ar publisher
Alter the publisher search order so that the publisher being added or modified
is searched before the publisher specified in this option.
.It Fl \-set-property Ar name Ns = Ns Ar value
Update an existing publisher property or add a new publisher property.
.It Fl \-sticky
Updates to packages that were installed from this publisher must also come from
this publisher.
This is the default behavior.
.It Fl \-unset-ca-cert Ar CA_hash
For verifying signed packages, remove the certificate with the given hash from
the list of approved certificates and the list of revoked certificates.
.It Fl \-unset-property Ar name
Remove an existing publisher property.
.It Fl v
Issue verbose progress messages during the requested operation.
.El
.Ed
.\" set-publisher -p
.Pp
.Nm
.Cm set-publisher
.Bk -words
.Fl p Ar repo_uri
.Op Fl Ped
.Op Fl c Ar ssl_cert
.Op Fl k Ar ssl_key
.Op Fl \-sticky
.Op Fl \-non-sticky
.Op Fl \-search-first
.Op Fl \-search-before Ar publisher
.Op Fl \-search-after Ar publisher
.Op Fl \-approve-ca-cert Ar path_to_CA
.Op Fl \-revoke-ca-cert Ar hash_of_CA_to_remove
.Op Fl \-unset-ca-cert Ar hash_of_CA_to_remove
.Op Fl \-set-property Ar name_of_property Ns = Ns Ar value
.Op Fl \-add-property-value Ar name_of_property Ns = Ns Ar value_to_add
.Op Fl \-remove-property-value Ar name_of_property Ns = Ns Ar value_to_remove
.Op Fl \-unset-property Ar name_of_property_to_delete
.Op Fl \-proxy Ar proxy_to_use
.Ek
.br
.Ar publisher
.Bd -ragged -offset Ds
Retrieve publisher configuration information from the
.Ar repo_uri
repository URI.
.Pp
If a publisher operand is specified to this
.Cm set-publisher
subcommand, then only that publisher is added or updated.
If no publisher is specified, all publishers in
.Ar repo_uri
are added or updated as appropriate.
.Pp
For descriptions of options, see the
.Cm set-publisher
command above.
When used with
.Fl p ,
the
.Fl P ,
.Fl \-search-first ,
.Fl \-search-before ,
and
.Fl \-search-after
options only apply to added publishers, not to updated publishers.
.Pp
The
.Fl p
option cannot be combined with the
.Fl g ,
.Fl \-add-origin ,
.Fl G ,
.Fl \-remove-origin ,
.Fl m ,
.Fl \-add-mirror ,
.Fl M ,
.Fl \-origin-uri ,
.Fl O ,
.Fl \-remove-mirror ,
.Fl \-disable ,
.Fl \-enable ,
.Fl \-no-refresh ,
or
.Fl \-reset-uuid
options.
.Ed
.\" unset-publisher
.Pp
.Nm
.Cm unset-publisher
.Ar publisher No ...
.Bd -ragged -offset Ds
Remove the configuration associated with the specified publisher or publishers.
.Ed
.\" history
.Pp
.Nm
.Cm history
.Bk -words
.Op Fl HNl
.Op Fl n Ar number
.Oo Fl o Ar column Ns Oo , Ns Ar column Oc Ns ... Oc Ns ...
.Oo Fl t Ar time | Ar time Ns - Ns Ar time Ns
.Oo , Ns Ar time | Ar time Ns - Ns Ar time
.Oc Ns ... Oc Ns ...
.Ek
.Bd -ragged -offset Ds
Display the command history of the applicable image.
Display the start time of the operation, the name of the operation
.Pq for example Cm install ,
the client
.Pq for example, Nm ,
and the outcome of the operation (Succeeded or Failed).
.Bl -tag -width Ds
.It Fl H
Omit the headers from the listing.
.It Fl l
Display the long form of the command history of the image.
Additional information displayed includes the version of the client, the name
of the user who performed the operation, whether a new boot environment was
created, the time the operation completed and total time taken, the complete
command that was issued, and any errors that were encountered while executing
the command.
For operations such as
.Cm update ,
complete FMRIs of changed packages are shown.
.It Fl N
Display the release note text.
.It Fl n Ar number
Display only the specified number of most recent entries.
.It Fl o Ar column
Display output using the specified column names.
The
.Fl o
option can be specified multiple times, or multiple column names can be
specified as the argument to one
.Fl o
option by separating the column names with commas.
.Pp
Valid column names are:
.Bl -tag -width Ds
.It Cm be
The name of the boot environment on which this operation was started.
.It Cm be_uuid
The
.Sy uuid
of the boot environment on which this operation was started.
.It Cm client
The name of the client.
.It Cm client_ver
The version of the client.
.It Cm command
The command line used for this operation.
.It Cm finish
The time that this operation finished.
.It Cm id
The user id that started this operation.
.It Cm new_be
The new boot environment created by this operation.
.It Cm new_be_uuid
The
.Sy uuid
of the new boot environment created by this operation.
.It Cm operation
The name of the operation.
.It Cm outcome
A summary of the outcome of this operation.
.It Cm reason
Additional information on the outcome of this operation.
.It Cm release_note
Indicates whether this operation generated release notes.
.It Cm snapshot
The snapshot taken during this operation.
This is only recorded if the snapshot was not automatically removed after
successful operation completion.
.It Cm start
The time that this operation started.
.It Cm time
The total time taken to perform this operation.
For operations that take less than one second, 0:00:00 is shown.
.It Cm user
The username that started this operation.
.El
.Pp
If the
.Cm command
or
.Cm reason
columns are specified, they must be the last item in the
.Fl o
list, in order to preserve output field separation.
These two columns cannot be shown in the same
.Cm history
command.
.Pp
An asterisk (*) is shown after the values for
.Cm be
or
.Cm new_be
if the boot environment is no longer present on the system.
.Pp
The values for
.Cm be
and
.Cm new_be
are obtained by looking up the current boot environment name, using the
.Cm be_uuid
or
.Cm new_be_uuid
fields.
If a boot environment was subsequently renamed, and later deleted, the values
displayed for
.Cm be
and
.Cm new_be
are the values recorded at the time of the
.Nm
operation.
.It Fl t Ar time | Fl Ar time Ns - Ns Ar time
Display log records for a comma-separated list of timestamps, formatted with
.Sy %Y-%m-%dT%H:%M:%S
.Pq see the Xr strftime 3C man page .
To specify a range of times, use a hyphen
.Pq Sy -
between a start and finish timestamp.
The keyword
.Sy now
can be used as an alias for the current time.
This option can be specified multiple times.
If the timestamps specified contain duplicate timestamps or overlapping ranges,
duplicate history events are not displayed.
Only a single instance of each history event is displayed.
.El
.Ed
.\" purge-history
.Pp
.Nm
.Cm purge-history
.Bd -ragged -offset Ds
Delete all existing history information.
.Ed
.\" rebuild-index
.Pp
.Nm
.Cm rebuild-index
.Bd -ragged -offset Ds
Rebuild the index used by
.Nm
.Cm search .
This is a recovery operation not intended for general use.
.Ed
.\" update-format
.Pp
.Nm
.Cm update-format
.Bd -ragged -offset Ds
Update the format of the image to the current version.
Once this operation has completed, the image can no longer be used with older
versions of the
.Xr pkg 5
system.
.Ed
.\" version
.Pp
.Nm
.Cm version
.Bd -ragged -offset Ds
Display a unique string identifying the version of
.Nm .
This string is not guaranteed to be comparable in any fashion between versions.
.Ed
.\" help
.Pp
.Nm
.Cm help
.Bd -ragged -offset Ds
Display a usage message.
.Ed
.\" image-create
.Pp
.Nm
.Cm image-create
.Bk -words
.Op Fl FPUfz
.Op Fl \-force
.br
.Op Fl \-full | Fl \-partial | Fl \-user
.Op Fl \-zone
.Op Fl c Ar ssl_cert
.Op Fl k Ar ssl_key
.Oo Fl g Ar path_or_uri | Fl \-origin Ar path_or_uri Oc Ns ...
.Oo Fl m Ar uri | Fl \-mirror Ar uri Oc Ns ...
.Oo Fl \-facet Ar facet_name Ns = Ns
.Pq True Ns | Ns False
.Oc Ns ...
.Op Fl \-no-refresh
.Op Fl \-set-property Ar name_of_property Ns = Ns Ar value
.Op Fl \-variant Ar variant_name Ns = Ns Ar value
.Oo
.Pq Fl p | Fl \-publisher
.Oo Ar name Ns = Oc Ns Ar repo_uri Oc
.Ar dir
.Ek
.Bd -ragged -offset Ds
At the location given by
.Ar dir ,
create an image suitable for package operations.
Images created by using the
.Cm image-create
subcommand are not bootable.
Most users should use the
.Fl \-be-name
or
.Fl \-require-new-be
options with
.Nm
commands, or use the
.Xr beadm 1M
or
.Xr zoneadm 1M
commands to create images.
The
.Nm
.Cm image-create
command is used for tasks such as maintaining packages and operating system
distributions.
.Pp
The default image type is user, which can be specified by using the
.Fl U
or
.Fl \-user
option.
Alternatively, the image type can be set to a full image
.Pq Fl F No or Fl \-full
or to a partial image
.Pq Fl P No or Fl \-partial
linked to the full image enclosing the given
.Ar dir
path.
.Pp
Additional origins can be specified using
.Fl g
or
.Fl \-origin .
Additional mirrors can be specified using
.Fl m
or
.Fl \-mirror .
.Pp
A package repository URI must be provided using the
.Fl p
or
.Fl \-publisher
option.
If a publisher name is also provided, then only that publisher is added when
the image is created.
If a publisher name is not provided, then all publishers known by the specified
repository are added to the image.
An attempt to retrieve the catalog associated with this publisher is made
following the initial creation operations.
.Pp
For publishers using client SSL authentication, a client key and client
certificate can be registered via the
.Fl c
and
.Fl k
options.
This key and certificate are used for all publishers added during image
creation.
.Pp
If the image is to be run within non-global zone context, use the
.Fl z
.Pq Fl \-zone
option to set an appropriate variant.
.Bl -tag -width Ds
.It Fl f | Fl \-force
Force the creation of an image over an existing image.
This option should be used with care.
.It Fl \-facet Ar name Ns = Ns Pq Cm True Ns | Ns Cm False
Set the specified facet to the indicated value.
See "Facets and Variants" in the
.Xr pkg 5
man page for more information about facets.
.It Fl \-no-refresh
Do not attempt to contact the repositories for the image's publishers to
retrieve the newest list of available packages and other metadata.
.It Fl \-set-property Ar name Ns = Ns Ar value
Set the specified image property to the indicated value.
See
.Sx Image Properties
below for descriptions of image properties.
.It Fl \-variant Ar name Ns = Ns Ar value
Set the specified variant to the indicated value.
See "Facets and Variants" in the
.Xr pkg 5
man page for more information about variants.
.El
.Ed
.\" dehydrate
.Pp
.Nm
.Fl R Ar dir Cm dehydrate
.Op Fl nvq
.Oo Fl p Ar publisher Oc Ns ...
.Bd -ragged -offset Ds
Remove all non-editable packaged files and packaged hardlinks from the image
specified by the
.Fl R
option to create a fully dehydrated image.
A non-editable packaged file is a file delivered by the currently installed
version of a package that has no
.Sy preserve
or
.Sy overlay
attribute, and
does not have a
.Sy dehydrate
attribute set to
.Sy false .
A packaged hardlink is a hardlink delivered by the currently installed version
of a package.
.Pp
The
.Nm
.Cm dehydrate
command only operates on an alternate root.
Use the
.Fl R
option to specify the alternate root.
If the alternate root belongs to a boot environment, dehydration will render it
unbootable.
.Pp
If the
.Nm
.Cm dehydrate
command succeeds, a property named
.Sy dehydrated
with the value of all publishers with a configured package repository is set on
the image specified by the
.Fl R
option.
.Pp
All other packaging operations for a dehydrated publisher will be automatically
dehydrated.
.Bl -tag -width Ds
.It Fl p Ar publisher
Remove only non-editable files and hardlinks delivered by the specified
publishers to create a partially dehydrated image.
If all configured publishers of the image are specified, a fully dehydrated
image is created as described above.
.Pp
If one or more publishers is specified, and if any of the publishers is not
configured in the image, then nothing is removed from the image.
.Pp
If the
.Nm
.Cm dehydrate
command succeeds, a property named
.Sy dehydrated
with the names of the publishers as the value is set on the image.
.El
.Pp
For all other options, see the
.Cm install
command above.
.Ed
.\" rehydrate
.Pp
.Nm
.Fl R Ar dir Cm rehydrate
.Op Fl nvq
.Oo Fl p Ar publisher Oc Ns ...
.Bd -ragged -offset Ds
Reinstall all files and hardlinks removed by the
.Nm
.Cm dehydrate
command.
.Pp
The
.Nm
.Cm rehydrate
command only operates on an alternate root.
Use the
.Fl R
option to specify the alternate root.
.Pp
If the
.Nm
.Cm rehydrate
command succeeds, the value of the
.Sy dehydrated
property of the image is removed.
.Bl -tag -width Ds
.It Fl p Ar publisher
Reinstall all files and hardlinks removed by the
.Nm
.Cm dehydrate
command for the specified publishers.
.Pp
If one or more publishers is specified, and if any of the the publishers is not
configured in the image, then nothing is installed.
.Pp
If the
.Nm
.Cm rehydrate
command succeeds, the specified publisher names are removed from the value of
the
.Sy dehydrated
property set on the image.
.El
.Pp
For all other options, see the
.Cm install
command above.
.Ed
.\"
.Sh IMAGE PROPERTIES
Daemons or other programs that need to know the time an image was last modified
can consult the time stamp on the file
.Pa /var/pkg/modified .
The time stamp on
.Pa /var/pkg/modified
is updated every time an operation occurs that modifies the image.
Use the
.Nm Cm history
command to display information about the change at that time.
.Pp
The following properties define characteristics of the image.
These properties store information about the purpose, content, and behavior of
the image.
To view the current values of these properties in the image, use the
.Nm Cm property
command.
To modify the values of these properties, use the
.Nm Cm set-property
and
.Nm Cm unset-property
commands.
.Bl -tag -width Ds
.It Cm auto-be-name
.Pq string
A template to be used for building a name for a new boot environment if one is
required as a result of an update.
Without this property being set, and assuming that the
.Fl \-be-name
option is not provided, the new BE will be named after the current, with an
incrementing numerical suffix.
If an update requires a new boot environment but is not associated with an
OmniOS release then the template will not be used.
The
.Fl \-be-name
option always overrides this property.
The template can contain the following tokens; see the
.Sx Examples
section for some suggested values.
.Bl -tag -width Ds
.It Cm %d
The publication date of the update being installed -
.Sy YYYY.MM.DD
.It Cm \%D
The publication date of the update being installed -
.Sy IYYYYMMDD
.It Cm \%r
The release being installed, without the leading
.Sy r -
e.g.
.Sy 151026c
.It Cm time : Ns Ar format
The current date and time in the format specified.
.Ar format
is a
.Xr strftime 3C - Ns
compatible string such as
.Sy omnios-%Y.%m.%d .
It is not advised to use hyphens for separating components as the trailing
component may be confused with a boot environment revision number.
.El
.Pp
The default value for the
.Cm auto-be-name
property is
.Dq Sy omnios-r%r .
.It Cm be-policy
.Pq string
Specify when a boot environment is created during packaging operations.
The following values are allowed:
.Bl -tag -width Ds
.It Cm default
Apply the default boot environment creation policy,
.Cm create-backup .
.It Cm always-new
Requires a reboot for all package operations by performing them in a new boot
environment set as active on the next boot.
A backup boot environment is not created unless explicitly requested.
.Pp
This policy is the safest, but is more strict than most sites need since no
packages can be added without a reboot.
.It Cm create-backup
For package operations that require a reboot, a new boot environment is created
and set as active on the next boot.
If packages are modified or content that could affect the kernel is installed
and the operation affects the live boot environment, a backup boot environment
is created but not set as active.
A backup boot environment can also be explicitly requested.
.Pp
This policy is potentially risky only if newly installed software causes system
instability, which is possible but relatively rare.
.It Cm when-required
For package operations that require a reboot, a new boot environment is created
and set as active on the next boot.
A backup boot environment is not created unless explicitly requested.
.Pp
This policy carries the greatest risk since if a packaging change to the live
boot environment makes further changes impossible, there might be no recent
boot environment to which one can fallback.
.El
.It Cm ca-path
.Pq string
A path name that points to a directory where CA certificates are kept for SSL
operations.
The format of this directory is specific to the underlying SSL implementation.
To use an alternate location for trusted CA certificates, change this value to
point to a different directory.
See the
.Sy CApath
portions of
.Xr SSL_CTX_load_verify_locations 3openssl
for requirements for the CA directory.
.Pp
Default value:
.Pa /etc/ssl/certs
.It Cm check-certificate-revocation
.Sq boolean
If this is set to
.Sy True ,
the package client attempts to contact any CRL distribution points in the
certificates used for signature verification to determine whether the
certificate has been revoked since being issued.
.Pp
Default value:
.Sy False
.It Cm content-update-policy
.Pq string
Specify when the package system will update non-editable files during packaging
operations.
The following values are allowed:
.Bl -tag -width Ds
.It Cm default
Always apply the default content update policy.
.It Cm always
Always download and update non-editable files that have changed.
.It Cm when-required
Download and update non-editable files that have changed only if the package system has determined that an update is required.
.El
.Pp
Default value:
.Sy always
.It Cm default-recurse
.Pq boolean
If set to
.Sy True ,
the package client will default to recursing into child images for
.Nm Cm update
operations, as if the
.Fl r
option had been provided on the command line.
This behaviour can be overriden on a per-case basis via the
.Fl R
option.
.Pp
Default value:
.Sy False
.It Cm exclude-patterns
.Pq string list
Any package delivering an action to a path which matches one of these patterns
is suppressed in the final execution plan.
The regular expression syntax used is that of Python.
For more information about Python regular expression syntax, use the command
.Sy pydoc re
or see more complete documentation at
.Lk http://docs.python.org/dev/howto/regex.html .
The regular expression is anchored at the beginning but not at the end,
therefore, a regular expression matching files by their extensions must include
a leading
.Ql .*
and should include a trailing
.Ql $ .
.Pp
Default value:
.Sy []
(empty list)
.It Cm flush-content-cache-on-success
.Pq boolean
If this is set to
.Sy True ,
the package client removes the files in its content-cache when image-modifying
operations complete successfully.
For operations that create a boot environment, the content will be removed from
both the source and destination boot environment.
.Pp
This property can be used to keep the content-cache small on systems with
limited disk space.
This property can cause operations to take longer to complete.
.Pp
Even when set to
.Sy False ,
the content cache can be manually cleaned up as required by running the
.Nm Cm clean
command.
.Pp
Default value:
.Sy True
.It Cm key-files
.Pq string list
A list of files which must exist within the image for it to be considered
complete.
If any listed file is missing,
.Nm
will refuse to perform update operations on the image.
.Pp
Default value:
.Sy []
(empty list)
.It Cm mirror-discovery
.Pq boolean
This property tells the client to discover link-local content mirrors using
mDNS and DNS-SD.
If this property is set to
.Sy True ,
the client attempts to download package content from mirrors it dynamically
discovers.
To run a mirror that advertises its content via mDNS, see the
.Xr pkg.depotd 1M
man page.
.Pp
Default value:
.Sy False
.It Cm recursion-concurrency
.Pq integer
Set the default concurrency for recursive package operations.
Refer to the documentation for the
.Fl C
option to
.Nm Cm install
above for more details.
.Pp
Default value:
.Sy 1
.It Cm send-uuid
.Pq boolean
Send the image's Universally Unique Identifier (UUID) when performing network
operations.
Although users can disable this option, some network repositories might refuse
to talk to clients that do not supply a UUID.
.Pp
Default value:
.Sy True
.It Cm signature-policy
.Pq string
Determine what checks will be performed on manifests when installing, updating,
modifying, or verifying packages in the image.
The final policy applied to a package depends on the combination of image
policy and publisher policy.
The combination will be at least as strict as the stricter of the two policies
taken individually.
By default, the package client does not check whether certificates have been
revoked.
To enable those checks, which might require the client to contact external
Internet sites, set the
.Sy check-certificate-revocation
image property to
.Sy True
The following values are allowed:
.Bl -tag -width Ds
.It Cm ignore
Ignore signatures for all manifests.
.It Cm verify
Verify that all manifests with signatures are validly signed, but do not
require all installed packages to be signed.
This is the default value.
.It Cm require-signatures
Require that all newly installed packages have at least one valid signature.
The
.Nm Cm fix
and
.Nm Cm verify
commands also warn if an installed package does not have a valid signature.
.It Cm require-names
Follow the same requirements as
.Cm require-signatures
but also require that the strings listed in the
.Sy signature-required-names
property appear as a common name of the certificates used to verify the chains
of trust of the signatures.
.El
.It Cm signature-required-names
.Pq list of strings
A list of names that must be seen as common names of certificates while
validating the signatures of a package.
.It Cm trust-anchor-directory
.Pq string
The path name of the directory that contains the trust anchors for the image.
This path is relative to the image.
.It Cm use-system-repo
.Pq boolean
This property indicates whether the image should use the system repository as a
source for image and publisher configuration and as a proxy for communicating
with the publishers provided.
The default value is
.Sy False .
.It Cm temp-be-activation
.Pq boolean
If set to
.Sy True
then, if a new boot environment is created as a result of the package
operation, and if it is activated, then that activation will be temporary -
that is, active for the next boot only - as if the
.Fl \-temp-be-activate
option had been provided on the command line.
.Pp
Default value:
.Sy False
.El
.\"
.Sh PUBLISHER PROPERTIES
The following properties define properties for a particular publisher.
To view the current values of these properties for a particular publisher, use
the
.Nm Cm publisher Ar publisher_name
command.
To modify the values of these publisher properties, use the
.Fl \-set-property
and
.Fl \-unset-property
options of the
.Nm Cm set-publisher
command.
.Bl -tag -width Ds
.It Cm nochild
.Pq boolean
If this property is set to True then the publisher is not required to
be present in linked child images.
The default value is
.Cm False .
.It Cm signature-policy
.Pq string
This property functions identically to the image property of the same name
except that it only applies to packages from the particular publisher.
.It Cm signature-required-names
.Pq list of strings
This property functions identically to the image property of the same name
except that it only applies to packages from the particular publisher.
.El
.Sh EXIT STATUS
.Bl -tag -width Ds
.It Sy 0
Command succeeded.
.It Sy 1
An error occurred.
.It Sy 2
Invalid command line options were specified.
.It Sy 3
Multiple operations were requested, but only some of them succeeded.
.It Sy 4
No changes were made - nothing to do.
.It Sy 5
The requested operation cannot be performed on a live image.
.It Sy 6
The requested operation cannot be completed because the licenses for the
packages being installed or updated have not been accepted.
.It Sy 7
The image is currently in use by another process and cannot be modified.
.It Sy 8
One or more SMF actuators timed out.
.It Sy 99
An unanticipated exception occurred.
.El
.Sh EXAMPLES
.Bl -tag -width 6
.\"
.It Sy Example 1 No Create an Image With Publisher Configured
.Pp
Create a new, full image, with publisher
.Sy example.com ,
stored at
.Pa /aux0/example_root .
.Bd -literal
    $ pkg image-create -F \e
        -p example.com=http://pkg.example.com:10000 \e
        /aux0/example_root
.Ed
.\"
.It Sy Example 2 No Create an Image, Specifying Additional Origins and Mirror
.Pp
Create a new, full image, with publisher
.Sy example.com ,
that also has an additional mirror, two additional origins, and is stored at
.Pa /aux0/example_root .
.Bd -literal
    $ pkg image-create -F \e
        -p example.com=http://pkg.example.com:10000 \e
        -g http://alternate1.example.com:10000/ \e
        -g http://alternate2.example.com:10000/ \e
        -m http://mirror.example.com:10000/ \e
        /aux0/example_root
.Ed
.\"
.It Sy Example 3 No Create an Image With No Publisher Configured
.Pp
Create a new, full image with no publishers configured at
.Pa /aux0/example_root .
.Bd -literal
    $ pkg image-create -F /aux0/example_root
.Ed
.\"
.It Sy Example 4 No Install a Package
.Pp
Install the latest version of the widget package in the current image.
.Bd -literal
    $ pkg install application/widget
.Ed
.\"
.It Sy Example 5 No List Specified Contents of a Package
.Pp
List the contents of the system/file-system/zfs package.
Display the action name, the mode of the file (if defined), the size (if
defined), the path, and the target (if a link).
Limit the action to types dir, file, link, and hardlink, since specifying the
action.name attribute, which is available for all actions, displays a line for
all actions, which is not desired here.
.Bd -literal
    $ pkg contents -t dir,file,link,hardlink \e
        -o action.name,mode,pkg.size,path,target \e
        system/file-system/zfs
    ACTION.NAME MODE PATH                 TARGET
    dir         0755 etc
    dir         0755 etc/fs
    dir         0755 etc/fs/zfs
    link             etc/fs/zfs/mount     ../../../usr/sbin/zfs
    link             etc/fs/zfs/umount    ../../../usr/sbin/zfs
    dir         0755 etc/zfs
    ...
.Ed
.\"
.It Sy Example 6 No List Specified Contents of Two Packages
.Pp
List the contents of web/browser/firefox and mail/thunderbird, limiting
the display to just the package name and path attributes of actions
whose path attribute ends in .desktop or .png.
.Bd -literal
    $ pkg contents -o pkg.name,path -a path=\e*.desktop \e
        -a path=\e*.png web/browser/firefox mail/thunderbird
    PKG.NAME            PATH
    web/browser/firefox usr/share/applications/firefox.desktop
    mail/thunderbird    usr/share/applications/thunderbird.desktop
    web/browser/firefox usr/share/pixmaps/firefox-icon.png
    mail/thunderbird    usr/share/pixmaps/thunderbird-icon.png
    ...
.Ed
.\"
.It Sy Example 7 No Search for a Package
.Pp
Search the package database for the token bge.
.Bd -literal
    $ pkg search bge
    INDEX       ACTION VALUE                          PACKAGE
    driver_name driver bge             pkg:/driver/network/bge
    basename    file   kernel/drv/bge  pkg:/driver/network/bge
    ...
.Ed
.\"
.It Sy Example 8 No Search for a File
.Pp
Search for the package that delivers a file by specifying the full path name of
the file, including the leading slash character.
.Bd -literal
    $ pkg search -o path,pkg.name -l /usr/bin/vim
    PATH         PKG.NAME
    usr/bin/vim  editor/vim/vim-core
.Ed
.Pp
Search for a file and the package that delivers that file by specifying file
for the action_name, path or basename for the index, and the full or partial
file name for the token.
.Bd -literal
    $ pkg search -o path,pkg.name -l file:basename:vim
    PATH         PKG.NAME
    usr/bin/vim  editor/vim/vim-core
.Ed
.\"
.It Sy Example 9 No Search for Files and Directories
.Pp
Search for files and directories and the packages that deliver them by
specifying path or basename for the index and the full or partial file name for
the token.
Depending on your shell, you might need to escape wildcards.
.Bd -literal
    $ pkg search -o path,pkg.name -l path:*/vim
    PATH           PKG.NAME
    usr/bin/vim    editor/vim/vim-core
    usr/share/vim  editor/vim
    usr/share/vim  editor/vim/vim-core

    $ pkg search -o path,pkg.name -l basename:vim
    PATH           PKG.NAME
    usr/share/vim  editor/vim
    usr/share/vim  editor/vim/vim-core
    usr/bin/vim    editor/vim/vim-core
.Ed
.\"
.It Sy Example 10 No Show Which Packages Provide Which SMF Services
.Pp
Show which packages provide a particular SMF service by specifying the value
org.opensolaris.smf.fmri for the index in a structured search and the name of
the service you want to find for the token.
The value org.opensolaris.smf.fmri is the name of an attribute of a set action.
Remember to escape the
.Sy \&:
in the name of the service.
.Pp
For example, show which HTTP servers are available by specifying the value
svc:/network/http for the token.
.Bd -literal
    $ pkg search 'org.opensolaris.smf.fmri:svc\:/network/ntp'
    INDEX                    ACTION VALUE            PACKAGE
    org.opensolaris.smf.fmri set    svc:/network/ntp ntpsec
.Ed
.\"
.It Sy Example 11 No Search for Packages that Depend on the Specified Package
.Pp
Search for installed packages that depend on package/pkg.
.Bd -literal
    $ pkg search -l 'depend::package/pkg'
    INDEX       ACTION VALUE                    PACKAGE
    incorporate depend package/pkg@0 pkg:/ips- incorporation@11
    require     depend package/pkg@0 pkg:/system/install@11
    require     depend package/pkg@0 pkg:/system-repository@11
.Ed
.\"
.It Sy Example 12 No Search for Dependencies
.Pp
Search for all incorporate dependencies in installed packages.
.Bd -literal
    $ pkg search -l 'depend:incorporate:'
    INDEX       ACTION VALUE           PACKAGE
    incorporate depend pkg:/BRCMbnx@0  pkg:/osnet-incorporation@1
    incorporate depend pkg:/BRCMbnxe@0 pkg:osnet-incorporation@1
    ...
.Ed
.\"
.It Sy Example 13 No Add a Publisher
.Pp
Add a new publisher example.com, with a repository located at
http://www.example.com/repo.
.Bd -literal
    $ pkg set-publisher -g http://www.example.com/repo example.com
.Ed
.\"
.It Sy Example 14 No Add a Publisher With Key and Certificate
.Pp
Add a new publisher example.com, with a secure repository located at
https://secure.example.com/repo, and a key and certificate stored in the
directory
.Pa /root/creds .
.Bd -literal
    $ pkg set-publisher -k /root/creds/example.key \e
        -c /root/creds/example.cert \e
        -g https://secure.example.com/repo \e
        example.com
.Ed
.\"
.It Sy Example 15 No Add and Automatically Configure a Publisher
.Pp
Add a new publisher with a repository located at
.Pa /export/repo
using automatic configuration.
.Bd -literal
    $ pkg set-publisher -p /export/repo
.Ed
.\"
.It Sy Example 16 No Add and Manually Configure a Publisher
.Pp
Add a new publisher example.com with a repository located at
.Pa /export/repo/example.com
using manual configuration.
.Bd -literal
    $ pkg set-publisher -g /export/repo example.com
.Ed
.\"
.It Sy Example 17 No Add a Publisher and Configure a Proxy
.Pp
Add a new publisher mypub with origin http://server/repo and proxy
http://webcache:8080.
.Bd -literal
    $ pkg set-publisher -g http://server/repo \e
        --proxy http://webcache:8080 mypub
.Ed
.\"
.It Sy Example 18 No Verify All Signed Packages
.Pp
Configure an image to verify all signed packages.
.Bd -literal
    $ pkg set-property signature-policy verify
.Ed
.\"
.It Sy Example 19 No Require All Packages To Be Signed
.Pp
Configure an image to require all packages to be signed, and require the string
example.com to be seen as a common name for one of the certificates in the
chain of trust.
.Bd -literal
    $ pkg set-property signature-policy require-names example.com
.Ed
.\"
.It Sy Example 20
Require All Packages From a Specified Publisher To Be Signed
.Pp
Configure an image so that all packages installed from publisher example.com
must be signed.
.Bd -literal
    $ pkg set-publisher \e
        --set-property signature-policy=require-signatures \e
        example.com
.Ed
.\"
.It Sy Example 21 No Require a Specified String in the Chain of Trust
.Pp
Add the string foo to the image's list of common names that must be seen in a
signature's chain of trust to be considered valid.
.Bd -literal
    $ pkg add-property-value signature-require-names foo
.Ed
.\"
.It Sy Example 22
Remove a String From the Chain of Trust for a Specified Publisher
.Pp
Remove the string foo from the list of common names that must be seen to
validate a signature for the publisher example.com.
.Bd -literal
    $ pkg set-publisher --remove-property-value \e
        signature-require-names=foo example.com
.Ed
.\"
.It Sy Example 23 No Add a Trusted CA Certificate
.Pp
Add the certificate stored in
.Pa /tmp/example_file.pem
as a trusted CA certificate for the publisher example.com.
.Bd -literal
    $ pkg set-publisher --approve-ca-cert /tmp/example_file.pem \e
        example.com
.Ed
.\"
.It Sy Example 24 No Revoke a Certificate
.Pp
Revoke the certificate with the hash a12345 for publisher example.com,
preventing the certificate from validating any signatures for packages from
example.com.
.Bd -literal
    $ pkg set-publisher --revoke-ca-cert a12345 example.com
.Ed
.\"
.It Sy Example 25 No Forget About a Certificate
.Pp
Make pkg forget that the certificate a12345 was ever added or revoked by the
user.
.Bd -literal
    $ pkg set-publisher --unset-ca-cert a12345 example.com
.Ed
.\"
.It Sy Example 26 No Downgrade a Package
.Pp
Downgrade the installed package foo@1.1 to an older version.
.Bd -literal
    $ pkg update foo@1.0
.Ed
.\"
.It Sy Example 27 No Switch Conflicting Package Installation
.Pp
In the case of two conflicting packages, change which package is
installed.
Suppose package A depends on either package B or package C, and B and C are
mutually exclusive.
If A and B are installed, use the following command to switch to using C
instead of B without uninstalling A:
.Bd -literal
    $ pkg install --reject B C
.Ed
.\"
.It Sy Example 28 No List Packages in a Package Archive
.Pp
List all versions of all packages in a package archive.
.Bd -literal
    $ pkg list -f -g /my/archive.p5p
.Ed
.\"
.It Sy Example 29 No List Packages in a Package Repository
.Pp
List all versions of all packages in a repository.
.Bd -literal
    $ pkg list -f -g http://example.com:10000
.Ed
.\"
.It Sy Example 30 No Display Information About a Package in a Package Archive
.Pp
Display the package information for the latest version of a package in a
package archive.
The package might or might not be currently installed.
.Bd -literal
    $ pkg info -g /my/archive.p5p pkg_name
.Ed
.\"
.It Sy Example 31 No Display Contents of a Package in a Package Archive
.Pp
Display the contents of a package in a package archive.
The package is not currently installed.
.Bd -literal
    $ pkg contents -g /my/archive.p5p pkg_name
.Ed
.\"
.It Sy Example 32 No Remove All Publisher Origins and Mirrors
.Pp
Remove all of the origins and mirrors for a publisher and add a new origin.
.Bd -literal
    $ pkg set-publisher -G '*' -M '*' \e
        -g http://example.com:10000 \e
        example.com
.Ed
.\"
.It Sy Example 33 No Dehydrating and Rehydrating an Image
.Pp
In these examples,
.Pa /tmp/test_image
is the image that you want to dehydrate and rehydrate.
.Pp
Because no publisher is specified, the following command operates on
all publishers with a configured package repository in the
.Pa /tmp/test_image
image to fully dehydrate the
.Pa /tmp/test_image image .
.Bd -literal
    $ pkg -R /tmp/test_image dehydrate
.Ed
.Pp
Since no publisher is specified, the following command operates on all
publishers configured in the
.Pa /tmp/test_image
image to fully restore the
.Pa /tmp/test_image image .
.Bd -literal
    $ pkg -R /tmp/test_image rehydrate
.Ed
.\"
.It Sy Example 34 No Dehydrating and Rehydrating an Image Specifying Publishers
.Pp
In these examples,
.Pa /tmp/test_image
is the image that you want to dehydrate and rehydrate, and the
.Sy test1
and
.Sy test2
publishers are configured with a package repository in the
.Pa /tmp/test_image
image.
.Pp
The following command operates only on files and hardlinks delivered by
the
.Sy test1
publisher.
.Bd -literal
    $ pkg -R /tmp/test_image dehydrate -p test1
.Ed
.Pp
The following command rehydrates only files and hardlinks delivered by the
.Sy test1
publisher.
.Bd -literal
    $ pkg -R /tmp/test_image rehydrate -p test1
.Ed
.\"
.It Sy Example 35 No Apply a hot-fix directly from a web repository
.Pp
Apply a hot-fix from a package archive file hosted on a remote web
server into a new boot environment called
.Sy testbe .
.Bd -literal
     $ pkg apply-hot-fix --be-name=testbe \e
         https://downloads.omnios.org/pkg/bloody/hotfix-1234.p5p
.Ed
.\"
.It Sy Example 36 No Set up a template for automatic boot environment naming
.Pp
The following will result in boot environments which include the
release name and date, for example
.Sy omnios_r151026k_20180716 .
.Bd -literal
    $ pkg set-property auto-be-name omnios_r%r_%D
.Ed
.Pp
To use the current date and time, use the time: prefix and a format string:
.Bd -literal
    $ pkg set-property auto-be-name time:omnios_%Y%m%d
.Ed
.Pp
For bloody releases, the release name does not change and so the
.Sy %r
token is not available.
The
.Sy \%D
token can be used to include the release date in the BE name:
.Bd -literal
    $ pkg set-property auto-be-name bloody_%D
.Ed
.\"
.It Sy Example 37 No Verify an Individual Path in an Image
.Pp
Verify an individual file at path
.Pa /usr/bin/ls
and display verbose result.
.Bd -literal
    $ pkg verify -v -p /usr/bin/ls
.Ed
.El
.Sh ENVIRONMENT VARIABLES
.Bl -tag -width Ds
.It Sy PKG_IMAGE
The directory containing the image to use for package operations.
Ignored if
.Fl R
is specified.
.It Sy PKG_CLIENT_CONNECT_TIMEOUT
Seconds to wait trying to connect during transport operations (for each
attempt) before the client aborts the operation.
A value of 0 means wait indefinitely.
.Pp
Default value: 60
.It Sy PKG_CLIENT_LOWSPEED_TIMEOUT
Seconds below the
.Sy lowspeed
limit (1024 bytes/second) during transport operations before the client aborts
the operation.
A value of 0 means do not abort the operation.
.Pp
Default value: 30
.It Sy PKG_CLIENT_MAX_CONSECUTIVE_ERROR
Maximum number of transient transport errors before the client aborts the
operation.
A value of 0 means do not abort the operation.
.Pp
Default value: 4
.It Sy PKG_CLIENT_MAX_REDIRECT
Maximum number of HTTP or HTTPS redirects allowed during transport operations
before a connection is aborted.
A value of 0 means do not abort the operation.
.Pp
Default value: 5
.It Sy PKG_CONCURRENCY
The number of child images to update in parallel.
Ignored if the
.Fl C
option is specified.
.Pp
When recursing into child images (usually installed
.Sy lipkg ,
.Sy sparse
or
.Sy pkgsrc
branded non-global zones), update at most
.Sy $PKG_CONCURRENCY
child images in parallel.
If
.Sy $PKG_CONCURRENCY
is 0 or a negative number, all child images are updated in parallel.
.Pp
Default value: 1
.It Sy PKG_CLIENT_MAX_TIMEOUT
Maximum number of transport attempts per host before the client aborts the
operation.
A value of 0 means do not abort the operation.
.Pp
Default value: 4
.It Sy http_proxy , Sy https_proxy
HTTP or HTTPS proxy server.
.El
.Sh FILES
A
.Xr pkg 5
image can be located arbitrarily within a larger file system.
In the following file descriptions, the token
.Sy $IMAGE_ROOT
is used to distinguish relative paths.
For a typical system installation,
.Sy $IMAGE_ROOT
is equivalent to
.Ql /
.Bl -tag -width Ds
.It Pa $IMAGE_ROOT/var/pkg
Metadata directory for a full or partial image.
.It Pa $IMAGE_ROOT/.org.opensolaris,pkg
Metadata directory for a user image.
.El
.Pp
Within a particular image's metadata, certain files and directories can contain
information useful during repair and recovery.
The token
.Sy $IMAGE_META
refers to the top-level directory containing the metadata.
.Sy $IMAGE_META
is typically one of the two paths given above.
.Bl -tag -width Ds
.It Pa $IMAGE_META/lost+found
Location of conflicting directories and files moved during a package operation.
Location of unpackaged contents of a removed directory.
.It Pa $IMAGE_META/publisher
Contains a directory for each publisher.
Each directory stores publisher-specific metadata.
.El
.Pp
Other paths within the
.Sy $IMAGE_META
directory hierarchy are private and are subject to change.
.Sh INTERFACE STABILITY
The command line interface of
.Nm
is
.Sy Uncommitted .
The output of
.Nm
is
.Sy Not-An-Interface
and may change at any time.
.Sh SEE ALSO
.Xr curl 1 ,
.Xr pkgsend 1 ,
.Xr beadm 1M ,
.Xr pkg.depotd 1M ,
.Xr pkg.sysrepo 1M ,
.Xr zoneadm 1M ,
.Xr glob 3C ,
.Xr strftime 3C ,
.Xr SSL_CTX_load_verify_locations 3openssl ,
.Xr pkg 5
